TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gsc.h
/*****************************************************************************

  Copyright (C) 2025 Texas Instruments Incorporated - http://www.ti.com/ 

  Redistribution and use in source and binary forms, with or without 
  modification, are permitted provided that the following conditions 
  are met:

   Redistributions of source code must retain the above copyright 
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the 
   documentation and/or other materials provided with the   
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

#ifndef ti_devices_msp_peripherals_hw_gsc__include
#define ti_devices_msp_peripherals_hw_gsc__include

/* This preliminary header file does not have a version number */
/* Filename: hw_gsc.h */
/* MMR revised: 2025-04-09 14:12:34 */
/* MMR repo: https://bitbucket.itg.ti.com/projects/cmcu_msp65soc/repos/m33c1 */
/* MMR revision: f4602b816b1643a266cc7aae6be755d35f394359 */
/* Generator revision: ee5e56ed8e50e22306abbffa1ce64d23abbf32b9
   (MInT: 1818019a64e181dbbfd48fdc69fea15367af4c13) */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* GSC Registers
******************************************************************************/


/** @addtogroup GSC
  @{
*/

typedef struct {
  __IO uint32_t Reserved_1[1024];                  /* !< (@ 0x00000000) */
  __IO uint32_t SPC_ATTRIBVIOLS_CONFIG;            /* !< (@ 0x00001000) SRAM Secure Access Attribute Violation
                                                      Configuration Register */
  __IO uint32_t SPC_ATTRIBVIOLP_CONFIG;            /* !< (@ 0x00001004) SRAM Privilege Access Attribute Violation
                                                      Configuration Register */
  __IO uint32_t Reserved_2[2];                     /* !< (@ 0x00001008) */
  __IO uint32_t PPC_ATTRIBVIOLS_CONFIG;            /* !< (@ 0x00001010) Peripheral Secure Access Attribute Violation
                                                      Configuration Register */
  __IO uint32_t PPC_ATTRIBVIOLP_CONFIG;            /* !< (@ 0x00001014) Peripheral Privilege Access Attribute Violation
                                                      Configuration Register */
  __IO uint32_t Reserved_3[2];                     /* !< (@ 0x00001018) */
  __IO uint32_t FPC_ATTRIBVIOLS_CONFIG;            /* !< (@ 0x00001020) Flash Secure Access Attribute Violation
                                                      Configuration Register */
  __IO uint32_t FPC_ATTRIBVIOLP_CONFIG;            /* !< (@ 0x00001024) Flash Privilege Access Attribute Violation
                                                      Configuration Register */
  __IO uint32_t Reserved_4[6];                     /* !< (@ 0x00001028) */
  __IO uint32_t FPC_HDPPROT0_CONFIG;               /* !< (@ 0x00001040) Flash Hide Protection for Bank0 Configuration
                                                      Register */
  __IO uint32_t FPC_HDPPROT1_CONFIG;               /* !< (@ 0x00001044) Flash Hide Protection for Bank1 Configuration
                                                      Register */
  __IO uint32_t Reserved_5;                        /* !< (@ 0x00001048) */
  __IO uint32_t FPC_HDPPROT_CONTROL;               /* !< (@ 0x0000104C) Flash Hide Protection Control Register */
  __IO uint32_t FPC_HDPEN_CONTROL;                 /* !< (@ 0x00001050) Flash Hide Protection Enable Control Register */
  __IO uint32_t FPC_NONMAIN0_HDPPROT_CONTROL;      /* !< (@ 0x00001054) Flash NONMAIN Bank0 Hide Protection Control
                                                      Register */
  __IO uint32_t FPC_NONMAIN1_HDPPROT_CONTROL;      /* !< (@ 0x00001058) Flash NONMAIN Bank1 Hide Protection Control
                                                      Register */
  __IO uint32_t FPC_TRIM0_HDPPROT_CONTROL;         /* !< (@ 0x0000105C) Flash TRIM Bank0 Hide Protection Control Register */
  __IO uint32_t FPC_TRIM1_HDPPROT_CONTROL;         /* !< (@ 0x00001060) Flash TRIM Bank1 Hide Protection Control Register */
  __IO uint32_t FPC_ENGR0_HDPPROT_CONTROL;         /* !< (@ 0x00001064) Flash ENGR Bank0 Hide Protection Control Register */
  __IO uint32_t FPC_ENGR1_HDPPROT_CONTROL;         /* !< (@ 0x00001068) Flash ENGR Bank1 Hide Protection Control Register */
  __IO uint32_t Reserved_6[5];                     /* !< (@ 0x0000106C) */
  __IO uint32_t FPC_HDPPROT_DBANK_CONFIG;          /* !< (@ 0x00001080) Data Flash Hide Protection Configuration Register */
  __IO uint32_t FPC_HDPPROT_DBANK_CONTROL;         /* !< (@ 0x00001084) Data Flash Hide Protection Control Register */
  __IO uint32_t FPC_HDPEN_DBANK_CONTROL;           /* !< (@ 0x00001088) Data Flash Hide Protection Enable Control Register */
  __IO uint32_t FPC_NONMAIN_HDPPROT_DBANK_CONTROL; /* !< (@ 0x0000108C) Data Flash NONMAIN Hide Protection Control
                                                      Register */
  __IO uint32_t FPC_TRIM_HDPPROT_DBANK_CONTROL;    /* !< (@ 0x00001090) Data Flash TRIM Hide Protection Control Register */
  __IO uint32_t FPC_ENGR_HDPPROT_DBANK_CONTROL;    /* !< (@ 0x00001094) Data Flash ENGR Hide Protection Control Register */
  __IO uint32_t Reserved_7[26];                    /* !< (@ 0x00001098) */
  __IO uint32_t PPC_SECATTRIB_ADC;                 /* !< (@ 0x00001100) Peripheral Secure Access ADC */
  __IO uint32_t Reserved_8;                        /* !< (@ 0x00001104) */
  __IO uint32_t PPC_SECATTRIB_TIMER;               /* !< (@ 0x00001108) Peripheral Secure Access Timer */
  __IO uint32_t Reserved_9;                        /* !< (@ 0x0000110C) */
  __IO uint32_t PPC_SECATTRIB_UNICOMM;             /* !< (@ 0x00001110) Peripheral Secure Access UniComm */
  __IO uint32_t Reserved_10;                       /* !< (@ 0x00001114) */
  __IO uint32_t PPC_SECATTRIB_GPIO;                /* !< (@ 0x00001118) Peripheral Secure Access GPIO */
  __IO uint32_t Reserved_11;                       /* !< (@ 0x0000111C) */
  __IO uint32_t PPC_SECATTRIB_MCAN;                /* !< (@ 0x00001120) Peripheral Secure Access CAN */
  __IO uint32_t Reserved_12;                       /* !< (@ 0x00001124) */
  __IO uint32_t PPC_SECATTRIB_I2S;                 /* !< (@ 0x00001128) Peripheral Secure Access I2S */
  __IO uint32_t Reserved_13;                       /* !< (@ 0x0000112C) */
  __IO uint32_t PPC_SECATTRIB_ACOMP;               /* !< (@ 0x00001130) Peripheral Secure Access Analog Comp */
  __IO uint32_t Reserved_14;                       /* !< (@ 0x00001134) */
  __IO uint32_t PPC_SECATTRIB_WDT;                 /* !< (@ 0x00001138) Peripheral Secure Access Watchdog */
  __IO uint32_t Reserved_15;                       /* !< (@ 0x0000113C) */
  __IO uint32_t PPC_SECATTRIB_LFSS;                /* !< (@ 0x00001140) Peripheral Secure Access LFSS */
  __IO uint32_t Reserved_16;                       /* !< (@ 0x00001144) */
  __IO uint32_t PPC_SECATTRIB_CRC;                 /* !< (@ 0x00001148) Peripheral Secure Access CRC */
  __IO uint32_t Reserved_17;                       /* !< (@ 0x0000114C) */
  __IO uint32_t PPC_SECATTRIB_AES;                 /* !< (@ 0x00001150) Peripheral Secure Access AES */
  __IO uint32_t Reserved_18;                       /* !< (@ 0x00001154) */
  __IO uint32_t PPC_SECATTRIB_SHA;                 /* !< (@ 0x00001158) Peripheral Secure Access SHA */
  __IO uint32_t Reserved_19;                       /* !< (@ 0x0000115C) */
  __IO uint32_t PPC_SECATTRIB_PKA;                 /* !< (@ 0x00001160) Peripheral Secure Access PKA */
  __IO uint32_t Reserved_20;                       /* !< (@ 0x00001164) */
  __IO uint32_t PPC_SECATTRIB_IOMUX;               /* !< (@ 0x00001168) Peripheral Secure Access IOMUX */
  __IO uint32_t Reserved_21;                       /* !< (@ 0x0000116C) */
  __IO uint32_t PPC_SECATTRIB_QSPI;                /* !< (@ 0x00001170) Peripheral Secure Access QSPI */
  __IO uint32_t Reserved_22;                       /* !< (@ 0x00001174) */
  __IO uint32_t PPC_SECATTRIB_TRNG;                /* !< (@ 0x00001178) Peripheral Secure Access TRNG */
  __IO uint32_t Reserved_23;                       /* !< (@ 0x0000117C) */
  __IO uint32_t PPC_SECATTRIB_DEBUGSS;             /* !< (@ 0x00001180) Peripheral Secure Access DEBUGSS */
  __IO uint32_t Reserved_24;                       /* !< (@ 0x00001184) */
  __IO uint32_t PPC_SECATTRIB_VREF;                /* !< (@ 0x00001188) Peripheral Secure Access VREF */
  __IO uint32_t Reserved_25;                       /* !< (@ 0x0000118C) */
  __IO uint32_t PPC_SECATTRIB_KEYSTORECTL;         /* !< (@ 0x00001190) Peripheral Secure Access KEYSTORECTL */
  __IO uint32_t Reserved_26;                       /* !< (@ 0x00001194) */
  __IO uint32_t PPC_SECATTRIB_EAM;                 /* !< (@ 0x00001198) Peripheral Secure Access EAM */
  __IO uint32_t Reserved_27;                       /* !< (@ 0x0000119C) */
  __IO uint32_t PPC_SECATTRIB_WUC;                 /* !< (@ 0x000011A0) Peripheral Secure Access WUC */
  __IO uint32_t Reserved_28;                       /* !< (@ 0x000011A4) */
  __IO uint32_t PPC_SECATTRIB_FRIREGS;             /* !< (@ 0x000011A8) Peripheral Secure Access FRIREGS */
  __IO uint32_t Reserved_29;                       /* !< (@ 0x000011AC) */
  __IO uint32_t PPC_SECATTRIB_MEMCFG;              /* !< (@ 0x000011B0) Peripheral Secure Access MEMCFG */
  __IO uint32_t Reserved_30[21];                   /* !< (@ 0x000011B4) */
  __IO uint32_t PPC_SECATTRIB_SYSCTL;              /* !< (@ 0x00001208) Peripheral Secure Access System Control */
  __IO uint32_t PPC_PRIVATTRIB_SYSCTL;             /* !< (@ 0x0000120C) Peripheral Privilege Access System Control */
  __IO uint32_t PPC_SECATTRIB_DMA;                 /* !< (@ 0x00001210) Peripheral Secure Access DMA */
  __IO uint32_t PPC_PRIVATTRIB_DMA;                /* !< (@ 0x00001214) Peripheral Privilege Access DMA */
  __IO uint32_t PPC_SECATTRIB_GSC;                 /* !< (@ 0x00001218) Peripheral Secure Access GSC */
  __IO uint32_t PPC_PRIVATTRIB_GSC;                /* !< (@ 0x0000121C) Peripheral Privilege Access GSC */
  __IO uint32_t PPC_SPARERW_GSC;                   /* !< (@ 0x00001220) Peripheral Spare RW Register */
  __IO uint32_t PPC_SPARERW1S_GSC;                 /* !< (@ 0x00001224) Peripheral Spare RW1S Register */
  __IO uint32_t Reserved_31[22];                   /* !< (@ 0x00001228) */
  __IO uint32_t SPC_SECATTRIB0;                    /* !< (@ 0x00001280) SRAM Secure Attribute-0 Register */
  __IO uint32_t SPC_SECATTRIB1;                    /* !< (@ 0x00001284) SRAM Secure Attribute-1 Register */
  __IO uint32_t SPC_SECATTRIB2;                    /* !< (@ 0x00001288) SRAM Secure Attribute-2 Register */
  __IO uint32_t SPC_SECATTRIB3;                    /* !< (@ 0x0000128C) SRAM Secure Attribute-3 Register */
  __IO uint32_t Reserved_32[12];                   /* !< (@ 0x00001290) */
  __IO uint32_t SPC_PRIVATTRIB0;                   /* !< (@ 0x000012C0) SRAM Privilege Attribute-0 Register */
  __IO uint32_t SPC_PRIVATTRIB1;                   /* !< (@ 0x000012C4) SRAM Privilege Attribute-1 Register */
  __IO uint32_t SPC_PRIVATTRIB2;                   /* !< (@ 0x000012C8) SRAM Privilege Attribute-2 Register */
  __IO uint32_t SPC_PRIVATTRIB3;                   /* !< (@ 0x000012CC) SRAM Privilege Attribute-3 Register */
  __IO uint32_t Reserved_33[12];                   /* !< (@ 0x000012D0) */
  __IO uint32_t FPC_SECATTRIBA0;                   /* !< (@ 0x00001300) Flash Secure Attribute Register A0 */
  __IO uint32_t FPC_SECATTRIBA1;                   /* !< (@ 0x00001304) Flash Secure Attribute Register A1 */
  __IO uint32_t FPC_SECATTRIBB0;                   /* !< (@ 0x00001308) Flash Secure Attribute Register B0 */
  __IO uint32_t FPC_SECATTRIBB1;                   /* !< (@ 0x0000130C) Flash Secure Attribute Register B1 */
  __IO uint32_t FPC_NONMAIN_SECATTRIB0;            /* !< (@ 0x00001310) Flash Non-Main Secure Attribute Register 0 */
  __IO uint32_t FPC_NONMAIN_SECATTRIB1;            /* !< (@ 0x00001314) Flash Non-Main Secure Attribute Register 1 */
  __IO uint32_t FPC_TRIM_SECATTRIB0;               /* !< (@ 0x00001318) Flash Trim Secure Attribute Register 0 */
  __IO uint32_t FPC_TRIM_SECATTRIB1;               /* !< (@ 0x0000131C) Flash Trim Secure Attribute Register 1 */
  __IO uint32_t FPC_ENGR_SECATTRIB0;               /* !< (@ 0x00001320) Flash Engr Secure Attribute Register 0 */
  __IO uint32_t FPC_ENGR_SECATTRIB1;               /* !< (@ 0x00001324) Flash Engr Secure Attribute Register 1 */
  __IO uint32_t Reserved_34[22];                   /* !< (@ 0x00001328) */
  __IO uint32_t FPC_SECATTRIBA_DFLASH;             /* !< (@ 0x00001380) Data Flash Secure Attribute Register A */
  __IO uint32_t FPC_ENGR_SECATTRIB_DFLASH;         /* !< (@ 0x00001384) Data Flash ENGR Secure Attribute Register */
  __IO uint32_t FPC_NONMAIN_SECATTRIB_DFLASH;      /* !< (@ 0x00001388) Data Flash Non-Main Secure Attribute Register */
  __IO uint32_t Reserved_35[29];                   /* !< (@ 0x0000138C) */
  __IO uint32_t FPC_PRIVATTRIBA0;                  /* !< (@ 0x00001400) Flash Privilege Attribute Register A0 */
  __IO uint32_t FPC_PRIVATTRIBA1;                  /* !< (@ 0x00001404) Flash Privilege Attribute Register A1 */
  __IO uint32_t FPC_PRIVATTRIBB0;                  /* !< (@ 0x00001408) Flash Privilege Attribute Register B0 */
  __IO uint32_t FPC_PRIVATTRIBB1;                  /* !< (@ 0x0000140C) Flash Privilege Attribute Register B1 */
  __IO uint32_t FPC_NONMAIN_PRIVATTRIB0;           /* !< (@ 0x00001410) Flash Non-Main Privilege Attribute Register B0 */
  __IO uint32_t FPC_NONMAIN_PRIVATTRIB1;           /* !< (@ 0x00001414) Flash Non-Main Privilege Attribute Register B1 */
  __IO uint32_t FPC_TRIM_PRIVATTRIB0;              /* !< (@ 0x00001418) Flash Trim Privilege Attribute Register B0 */
  __IO uint32_t FPC_TRIM_PRIVATTRIB1;              /* !< (@ 0x0000141C) Flash Trim Privilege Attribute Register B1 */
  __IO uint32_t FPC_ENGR_PRIVATTRIB0;              /* !< (@ 0x00001420) Flash Engr Privilege Attribute Register B0 */
  __IO uint32_t FPC_ENGR_PRIVATTRIB1;              /* !< (@ 0x00001424) Flash Engr Privilege Attribute Register B1 */
  __IO uint32_t Reserved_36[22];                   /* !< (@ 0x00001428) */
  __IO uint32_t FPC_PRIVATTRIBA_DFLASH;            /* !< (@ 0x00001480) Data Flash Privilege Attribute Register */
  __IO uint32_t FPC_NONMAIN_PRIVATTRIB_DFLASH;     /* !< (@ 0x00001484) Data Flash NONMAIN Privilege Attribute Register */
  __IO uint32_t FPC_ENGR_PRIVATTRIB_DFLASH;        /* !< (@ 0x00001488) Data Flash ENGR Privilege Attribute Register */
  __IO uint32_t Reserved_37[93];                   /* !< (@ 0x0000148C) */
  __IO uint32_t FPC_WEPROTA0;                      /* !< (@ 0x00001600) Flash Write Protect Attribute Register A0 */
  __IO uint32_t FPC_WEPROTA1;                      /* !< (@ 0x00001604) Flash Write Protect Attribute Register A1 */
  __IO uint32_t FPC_WEPROTB0;                      /* !< (@ 0x00001608) Flash Write Protect Attribute Register B0 */
  __IO uint32_t FPC_WEPROTB1;                      /* !< (@ 0x0000160C) Flash Write Protect Attribute Register B1 */
  __IO uint32_t FPC_WEPROTNONMAIN0;                /* !< (@ 0x00001610) Flash Non-Main Write Protect Attribute Register B0 */
  __IO uint32_t FPC_WEPROTNONMAIN1;                /* !< (@ 0x00001614) Flash Non-Main Write Protect Attribute Register B1 */
  __IO uint32_t FPC_WEPROTTRIM0;                   /* !< (@ 0x00001618) Flash Trim Write Protect Attribute Register B0 */
  __IO uint32_t FPC_WEPROTTRIM1;                   /* !< (@ 0x0000161C) Flash Trim Write Protect Attribute Register B1 */
  __IO uint32_t FPC_WEPROTENGR0;                   /* !< (@ 0x00001620) Flash Engr Write Protect Attribute Register B0 */
  __IO uint32_t FPC_WEPROTENGR1;                   /* !< (@ 0x00001624) Flash Engr Write Protect Attribute Register B1 */
  __IO uint32_t Reserved_38[54];                   /* !< (@ 0x00001628) */
  __IO uint32_t FPC_WEPROTA_DFLASH;                /* !< (@ 0x00001700) Data Flash Write Protect Attribute Register A */
  __IO uint32_t FPC_WEPROT_NONMAIN_DFLASH;         /* !< (@ 0x00001704) DATA Flash Non- Main Write Protect Attribute
                                                      Register */
  __IO uint32_t FPC_WEPROT_ENGR_DFLASH;            /* !< (@ 0x00001708) DATA Flash ENGR Write Protect Attribute Register */
  __IO uint32_t Reserved_39[61];                   /* !< (@ 0x0000170C) */
  __IO uint32_t FPC_FLSEMREQ;                      /* !< (@ 0x00001800) Flash semaphore request register */
  __IO uint32_t FPC_FLSEMCLR;                      /* !< (@ 0x00001804) Flash semaphore release register */
  __IO uint32_t FPC_FLSEMSTAT;                     /* !< (@ 0x00001808) Flash semaphore statys registers */
  __IO uint32_t Reserved_40[157];                  /* !< (@ 0x0000180C) */
  __IO uint32_t DMA_TRIG_SEL;                      /* !< (@ 0x00001A80) DMA Trigger Selection register */
  __IO uint32_t DMA_FIX_TRIG_SEL;                  /* !< (@ 0x00001A84) DMA Fixed Trigger Selection register */
  __IO uint32_t Reserved_41[62];                   /* !< (@ 0x00001A88) */
  __IO uint32_t VTOR_S;                            /* !< (@ 0x00001B80) Secure Vector Table Offset Register */
  __IO uint32_t VTOR_NS;                           /* !< (@ 0x00001B84) Non - Secure Vector Table Offset Register */
  __IO uint32_t Reserved_42[62];                   /* !< (@ 0x00001B88) */
  __IO uint32_t DTB_MUXSEL;                        /* !< (@ 0x00001C80) Digital Test Bus MUX Selection */
  __IO uint32_t Reserved_43[31];                   /* !< (@ 0x00001C84) */
  __IO uint32_t DICE_CHECKSUM0;                    /* !< (@ 0x00001D00) DICE checksum data register-0 */
  __IO uint32_t DICE_CHECKSUM1;                    /* !< (@ 0x00001D04) DICE checksum data register-1 */
  __IO uint32_t DICE_CHECKSUM2;                    /* !< (@ 0x00001D08) DICE checksum data register-2 */
  __IO uint32_t DICE_CHECKSUM3;                    /* !< (@ 0x00001D0C) DICE checksum data register-3 */
  __IO uint32_t DICE_CHECKSUM4;                    /* !< (@ 0x00001D10) DICE checksum data register-4 */
  __IO uint32_t DICE_CHECKSUM5;                    /* !< (@ 0x00001D14) DICE checksum data register-5 */
  __IO uint32_t DICE_CHECKSUM6;                    /* !< (@ 0x00001D18) DICE checksum data register-6 */
  __IO uint32_t DICE_CHECKSUM7;                    /* !< (@ 0x00001D1C) DICE checksum data register-7 */
  __IO uint32_t Reserved_44[24];                   /* !< (@ 0x00001D20) */
  __IO uint32_t GSC_LOCK;                          /* !< (@ 0x00001D80) GSC Lock configuration register */
  __IO uint32_t GSC_COMMIT;                        /* !< (@ 0x00001D84) GSC commit configuration register */
  __IO uint32_t Reserved_45[157];                  /* !< (@ 0x00001D88) */
  __IO uint32_t GSC_REVISION;                      /* !< (@ 0x00001FFC) GSC Revision register */
} GSC_Regs;

