TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gsc.h
/*@}*/ /* end of group GSC */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* GSC Register Control Bits
******************************************************************************/

/* GSC_SPC_ATTRIBVIOLS_CONFIG Bits */
/* GSC_SPC_ATTRIBVIOLS_CONFIG[SECVIOL] Bits */
#define GSC_SPC_ATTRIBVIOLS_CONFIG_SECVIOL_OFS   (0)                             /* !< SECVIOL Offset */
#define GSC_SPC_ATTRIBVIOLS_CONFIG_SECVIOL_MASK  ((uint32_t)0x00000001U)         /* !< Controls the behavior of secure
                                                                                    access to non-secure SRAM #br#0:
                                                                                    Access is allowed #br#1: Access
                                                                                    generates bus-fault and NMI */

/* GSC_SPC_ATTRIBVIOLP_CONFIG Bits */
/* GSC_SPC_ATTRIBVIOLP_CONFIG[PRIVVIOL] Bits */
#define GSC_SPC_ATTRIBVIOLP_CONFIG_PRIVVIOL_OFS  (0)                             /* !< PRIVVIOL Offset */
#define GSC_SPC_ATTRIBVIOLP_CONFIG_PRIVVIOL_MASK ((uint32_t)0x00000001U)         /* !< Controls the behavior of privilege
                                                                                    access to non-privilege SRAM #br#0:
                                                                                    Access is allowed #br#1: Access
                                                                                    generates bus-fault and NMI */

/* GSC_PPC_ATTRIBVIOLS_CONFIG Bits */
/* GSC_PPC_ATTRIBVIOLS_CONFIG[SECVIOL] Bits */
#define GSC_PPC_ATTRIBVIOLS_CONFIG_SECVIOL_OFS   (0)                             /* !< SECVIOL Offset */
#define GSC_PPC_ATTRIBVIOLS_CONFIG_SECVIOL_MASK  ((uint32_t)0x00000001U)         /* !< Controls the behavior of secure
                                                                                    access to non-secure peripheral
                                                                                    #br#0: Access is allowed #br#1:
                                                                                    Access generates bus-fault and NMI */

/* GSC_PPC_ATTRIBVIOLP_CONFIG Bits */
/* GSC_PPC_ATTRIBVIOLP_CONFIG[PRIVVIOL] Bits */
#define GSC_PPC_ATTRIBVIOLP_CONFIG_PRIVVIOL_OFS  (0)                             /* !< PRIVVIOL Offset */
#define GSC_PPC_ATTRIBVIOLP_CONFIG_PRIVVIOL_MASK ((uint32_t)0x00000001U)         /* !< Controls the behavior of privilege
                                                                                    access to non-privilege peripherals
                                                                                    #br#0: Access is allowed #br#1:
                                                                                    Access generates bus-fault and NMI */

/* GSC_FPC_ATTRIBVIOLS_CONFIG Bits */
/* GSC_FPC_ATTRIBVIOLS_CONFIG[SECVIOL] Bits */
#define GSC_FPC_ATTRIBVIOLS_CONFIG_SECVIOL_OFS   (0)                             /* !< SECVIOL Offset */
#define GSC_FPC_ATTRIBVIOLS_CONFIG_SECVIOL_MASK  ((uint32_t)0x00000001U)         /* !< Controls the behavior of secure
                                                                                    access to non-secure Flash #br#0:
                                                                                    Access is allowed #br#1: Access
                                                                                    generates bus-fault and NMI */

/* GSC_FPC_ATTRIBVIOLP_CONFIG Bits */
/* GSC_FPC_ATTRIBVIOLP_CONFIG[PRIVVIOL] Bits */
#define GSC_FPC_ATTRIBVIOLP_CONFIG_PRIVVIOL_OFS  (0)                             /* !< PRIVVIOL Offset */
#define GSC_FPC_ATTRIBVIOLP_CONFIG_PRIVVIOL_MASK ((uint32_t)0x00000001U)         /* !< Controls the behavior of privilege
                                                                                    access to non-privilege Flash #br#0:
                                                                                    Access is allowed #br#1: Access
                                                                                    generates bus-fault and NMI */

/* GSC_FPC_HDPPROT0_CONFIG Bits */
/* GSC_FPC_HDPPROT0_CONFIG[HDPEND] Bits */
#define GSC_FPC_HDPPROT0_CONFIG_HDPEND_OFS       (0)                             /* !< HDPEND Offset */
#define GSC_FPC_HDPPROT0_CONFIG_HDPEND_MASK      ((uint32_t)0x000000FFU)         /* !< Sector number where hide protection
                                                                                    ends */
/* GSC_FPC_HDPPROT0_CONFIG[HDPSTART] Bits */
#define GSC_FPC_HDPPROT0_CONFIG_HDPSTART_OFS     (16)                            /* !< HDPSTART Offset */
#define GSC_FPC_HDPPROT0_CONFIG_HDPSTART_MASK    ((uint32_t)0x00FF0000U)         /* !< Sector number where hide protection
                                                                                    starts */

/* GSC_FPC_HDPPROT1_CONFIG Bits */
/* GSC_FPC_HDPPROT1_CONFIG[HDPEND] Bits */
#define GSC_FPC_HDPPROT1_CONFIG_HDPEND_OFS       (0)                             /* !< HDPEND Offset */
#define GSC_FPC_HDPPROT1_CONFIG_HDPEND_MASK      ((uint32_t)0x000000FFU)         /* !< Sector number where hide protection
                                                                                    ends */
/* GSC_FPC_HDPPROT1_CONFIG[HDPSTART] Bits */
#define GSC_FPC_HDPPROT1_CONFIG_HDPSTART_OFS     (16)                            /* !< HDPSTART Offset */
#define GSC_FPC_HDPPROT1_CONFIG_HDPSTART_MASK    ((uint32_t)0x00FF0000U)         /* !< Sector number where hide protection
                                                                                    starts */

/* GSC_FPC_HDPPROT_CONTROL Bits */
/* GSC_FPC_HDPPROT_CONTROL[HDPPROT0ACCDIS] Bits */
#define GSC_FPC_HDPPROT_CONTROL_HDPPROT0ACCDIS_OFS (0)                             /* !< HDPPROT0ACCDIS Offset */
#define GSC_FPC_HDPPROT_CONTROL_HDPPROT0ACCDIS_MASK ((uint32_t)0x00000001U)         /* !< Enables the FPC_HDPPROT0_CONFIG to
                                                                                    take effect. #br#0: HDP region access
                                                                                    is enabled #br#1: HDP region access
                                                                                    is disabled */
/* GSC_FPC_HDPPROT_CONTROL[HDPPROT1ACCDIS] Bits */
#define GSC_FPC_HDPPROT_CONTROL_HDPPROT1ACCDIS_OFS (1)                             /* !< HDPPROT1ACCDIS Offset */
#define GSC_FPC_HDPPROT_CONTROL_HDPPROT1ACCDIS_MASK ((uint32_t)0x00000002U)         /* !< Enables the FPC_HDPPROT1_CONFIG to
                                                                                    take effect. #br#0: HDP region access
                                                                                    is enabled #br#1: HDP region access
                                                                                    is disabled */

/* GSC_FPC_HDPEN_CONTROL Bits */
/* GSC_FPC_HDPEN_CONTROL[HDPEN] Bits */
#define GSC_FPC_HDPEN_CONTROL_HDPEN_OFS          (0)                             /* !< HDPEN Offset */
#define GSC_FPC_HDPEN_CONTROL_HDPEN_MASK         ((uint32_t)0x00000001U)         /* !< HDP mode enable. This bit is set in
                                                                                    the OTP during provisioning.  #br#0:
                                                                                    HDP mode is not used #br#1: HDP mode
                                                                                    is enabled */

/* GSC_FPC_NONMAIN0_HDPPROT_CONTROL Bits */
/* GSC_FPC_NONMAIN0_HDPPROT_CONTROL[HDPROTACCDIS] Bits */
#define GSC_FPC_NONMAIN0_HDPPROT_CONTROL_HDPROTACCDIS_OFS (0)                             /* !< HDPROTACCDIS Offset */
#define GSC_FPC_NONMAIN0_HDPPROT_CONTROL_HDPROTACCDIS_MASK ((uint32_t)0x0000000FU)         /* !< Enable HDP access to NONMAIN region
                                                                                    #br#0: HDP region access is enabled
                                                                                    #br#1: HDP region access is disabled */

