TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gsc.h
/* GSC_FPC_NONMAIN1_HDPPROT_CONTROL Bits */
/* GSC_FPC_NONMAIN1_HDPPROT_CONTROL[HDPROTACCDIS] Bits */
#define GSC_FPC_NONMAIN1_HDPPROT_CONTROL_HDPROTACCDIS_OFS (0)                             /* !< HDPROTACCDIS Offset */
#define GSC_FPC_NONMAIN1_HDPPROT_CONTROL_HDPROTACCDIS_MASK ((uint32_t)0x0000000FU)         /* !< Enable HDP access to NONMAIN region
                                                                                    #br#0: HDP region access is enabled
                                                                                    #br#1: HDP region access is disabled */

/* GSC_FPC_TRIM0_HDPPROT_CONTROL Bits */
/* GSC_FPC_TRIM0_HDPPROT_CONTROL[HDPROTACCDIS] Bits */
#define GSC_FPC_TRIM0_HDPPROT_CONTROL_HDPROTACCDIS_OFS (0)                             /* !< HDPROTACCDIS Offset */
#define GSC_FPC_TRIM0_HDPPROT_CONTROL_HDPROTACCDIS_MASK ((uint32_t)0x00000001U)         /* !< Enable HDP access to TRIM region
                                                                                    #br#0: HDP region access is enabled
                                                                                    #br#1: HDP region access is disabled */
/* GSC_FPC_TRIM0_HDPPROT_CONTROL[HDPROTACCDIS1] Bits */
#define GSC_FPC_TRIM0_HDPPROT_CONTROL_HDPROTACCDIS1_OFS (1)                             /* !< HDPROTACCDIS1 Offset */
#define GSC_FPC_TRIM0_HDPPROT_CONTROL_HDPROTACCDIS1_MASK ((uint32_t)0x00000002U)         /* !< No functionality implemented for
                                                                                    this bit */

/* GSC_FPC_TRIM1_HDPPROT_CONTROL Bits */
/* GSC_FPC_TRIM1_HDPPROT_CONTROL[HDPROTACCDIS] Bits */
#define GSC_FPC_TRIM1_HDPPROT_CONTROL_HDPROTACCDIS_OFS (0)                             /* !< HDPROTACCDIS Offset */
#define GSC_FPC_TRIM1_HDPPROT_CONTROL_HDPROTACCDIS_MASK ((uint32_t)0x00000001U)         /* !< Enable HDP access to TRIM region
                                                                                    #br#0: HDP region access is enabled
                                                                                    #br#1: HDP region access is disabled */
/* GSC_FPC_TRIM1_HDPPROT_CONTROL[HDPROTACCDIS1] Bits */
#define GSC_FPC_TRIM1_HDPPROT_CONTROL_HDPROTACCDIS1_OFS (1)                             /* !< HDPROTACCDIS1 Offset */
#define GSC_FPC_TRIM1_HDPPROT_CONTROL_HDPROTACCDIS1_MASK ((uint32_t)0x00000002U)         /* !< No functionality implemented for
                                                                                    this bit */

/* GSC_FPC_ENGR0_HDPPROT_CONTROL Bits */
/* GSC_FPC_ENGR0_HDPPROT_CONTROL[HDPROTACCDIS] Bits */
#define GSC_FPC_ENGR0_HDPPROT_CONTROL_HDPROTACCDIS_OFS (0)                             /* !< HDPROTACCDIS Offset */
#define GSC_FPC_ENGR0_HDPPROT_CONTROL_HDPROTACCDIS_MASK ((uint32_t)0x00000001U)         /* !< Enable HDP access to ENGR region
                                                                                    #br#0: HDP region access is enabled
                                                                                    #br#1: HDP region access is disabled */
/* GSC_FPC_ENGR0_HDPPROT_CONTROL[HDPROTACCDIS1] Bits */
#define GSC_FPC_ENGR0_HDPPROT_CONTROL_HDPROTACCDIS1_OFS (1)                             /* !< HDPROTACCDIS1 Offset */
#define GSC_FPC_ENGR0_HDPPROT_CONTROL_HDPROTACCDIS1_MASK ((uint32_t)0x00000002U)         /* !< No functionality implemented for
                                                                                    this bit */

/* GSC_FPC_ENGR1_HDPPROT_CONTROL Bits */
/* GSC_FPC_ENGR1_HDPPROT_CONTROL[HDPROTACCDIS] Bits */
#define GSC_FPC_ENGR1_HDPPROT_CONTROL_HDPROTACCDIS_OFS (0)                             /* !< HDPROTACCDIS Offset */
#define GSC_FPC_ENGR1_HDPPROT_CONTROL_HDPROTACCDIS_MASK ((uint32_t)0x00000001U)         /* !< Enable HDP access to ENGR region
                                                                                    #br#0: HDP region access is enabled
                                                                                    #br#1: HDP region access is disabled */
/* GSC_FPC_ENGR1_HDPPROT_CONTROL[HDPROTACCDIS1] Bits */
#define GSC_FPC_ENGR1_HDPPROT_CONTROL_HDPROTACCDIS1_OFS (1)                             /* !< HDPROTACCDIS1 Offset */
#define GSC_FPC_ENGR1_HDPPROT_CONTROL_HDPROTACCDIS1_MASK ((uint32_t)0x00000002U)         /* !< No functionality implemented for
                                                                                    this bit */

/* GSC_FPC_HDPPROT_DBANK_CONFIG Bits */
/* GSC_FPC_HDPPROT_DBANK_CONFIG[HDPEND] Bits */
#define GSC_FPC_HDPPROT_DBANK_CONFIG_HDPEND_OFS  (0)                             /* !< HDPEND Offset */
#define GSC_FPC_HDPPROT_DBANK_CONFIG_HDPEND_MASK ((uint32_t)0x0000000FU)         /* !< Sector number where hide protection
                                                                                    ends */
/* GSC_FPC_HDPPROT_DBANK_CONFIG[HDPSTART] Bits */
#define GSC_FPC_HDPPROT_DBANK_CONFIG_HDPSTART_OFS (16)                            /* !< HDPSTART Offset */
#define GSC_FPC_HDPPROT_DBANK_CONFIG_HDPSTART_MASK ((uint32_t)0x000F0000U)         /* !< Sector number where hide protection
                                                                                    starts */

/* GSC_FPC_HDPPROT_DBANK_CONTROL Bits */
/* GSC_FPC_HDPPROT_DBANK_CONTROL[HDPPROTACCDIS] Bits */
#define GSC_FPC_HDPPROT_DBANK_CONTROL_HDPPROTACCDIS_OFS (0)                             /* !< HDPPROTACCDIS Offset */
#define GSC_FPC_HDPPROT_DBANK_CONTROL_HDPPROTACCDIS_MASK ((uint32_t)0x00000001U)         /* !< Enables the HDP register to take
                                                                                    effect for Databank #br#0: HDP region
                                                                                    access is enabled #br#1: HDP region
                                                                                    access is disabled */

