TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gsc.h
/* GSC_FPC_HDPEN_DBANK_CONTROL Bits */
/* GSC_FPC_HDPEN_DBANK_CONTROL[HDPEN] Bits */
#define GSC_FPC_HDPEN_DBANK_CONTROL_HDPEN_OFS    (0)                             /* !< HDPEN Offset */
#define GSC_FPC_HDPEN_DBANK_CONTROL_HDPEN_MASK   ((uint32_t)0x00000001U)         /* !< HDP mode enable. This bit is set in
                                                                                    the OTP during provisioning and
                                                                                    copied from the OTP memory during
                                                                                    boot by BOOTROM.  #br#0: HDP mode is
                                                                                    not used #br#1: HDP mode is enabled */

/* GSC_FPC_NONMAIN_HDPPROT_DBANK_CONTROL Bits */
/* GSC_FPC_NONMAIN_HDPPROT_DBANK_CONTROL[HDPROTACCDIS] Bits */
#define GSC_FPC_NONMAIN_HDPPROT_DBANK_CONTROL_HDPROTACCDIS_OFS (0)                             /* !< HDPROTACCDIS Offset */
#define GSC_FPC_NONMAIN_HDPPROT_DBANK_CONTROL_HDPROTACCDIS_MASK ((uint32_t)0x0000000FU)         /* !< Enable HDP access to NONMAIN region
                                                                                    #br#0: HDP region access is enabled
                                                                                    #br#1: HDP region access is disabled */

/* GSC_FPC_TRIM_HDPPROT_DBANK_CONTROL Bits */
/* GSC_FPC_TRIM_HDPPROT_DBANK_CONTROL[HDPROTACCDIS] Bits */
#define GSC_FPC_TRIM_HDPPROT_DBANK_CONTROL_HDPROTACCDIS_OFS (0)                             /* !< HDPROTACCDIS Offset */
#define GSC_FPC_TRIM_HDPPROT_DBANK_CONTROL_HDPROTACCDIS_MASK ((uint32_t)0x00000003U)         /* !< Enable HDP access to TRIM region
                                                                                    #br#0: HDP region access is enabled
                                                                                    #br#1: HDP region access is disabled */

/* GSC_FPC_ENGR_HDPPROT_DBANK_CONTROL Bits */
/* GSC_FPC_ENGR_HDPPROT_DBANK_CONTROL[HDPROTACCDIS] Bits */
#define GSC_FPC_ENGR_HDPPROT_DBANK_CONTROL_HDPROTACCDIS_OFS (0)                             /* !< HDPROTACCDIS Offset */
#define GSC_FPC_ENGR_HDPPROT_DBANK_CONTROL_HDPROTACCDIS_MASK ((uint32_t)0x00000001U)         /* !< Enable HDP access to ENGR region
                                                                                    #br#0: HDP region access is enabled
                                                                                    #br#1: HDP region access is disabled */
/* GSC_FPC_ENGR_HDPPROT_DBANK_CONTROL[HDPROTACCDIS1] Bits */
#define GSC_FPC_ENGR_HDPPROT_DBANK_CONTROL_HDPROTACCDIS1_OFS (1)                             /* !< HDPROTACCDIS1 Offset */
#define GSC_FPC_ENGR_HDPPROT_DBANK_CONTROL_HDPROTACCDIS1_MASK ((uint32_t)0x00000002U)         /* !< No functionality implemented for
                                                                                    this bit */

/* GSC_PPC_SECATTRIB_ADC Bits */
/* GSC_PPC_SECATTRIB_ADC[SEC_ADC0] Bits */
#define GSC_PPC_SECATTRIB_ADC_SEC_ADC0_OFS       (0)                             /* !< SEC_ADC0 Offset */
#define GSC_PPC_SECATTRIB_ADC_SEC_ADC0_MASK      ((uint32_t)0x00000001U)         /* !< Secure access enabled to ADC0
                                                                                    #br#0: Non-secure access is enabled
                                                                                    #br#1: Secure access is enabled */
/* GSC_PPC_SECATTRIB_ADC[SEC_ADC1] Bits */
#define GSC_PPC_SECATTRIB_ADC_SEC_ADC1_OFS       (1)                             /* !< SEC_ADC1 Offset */
#define GSC_PPC_SECATTRIB_ADC_SEC_ADC1_MASK      ((uint32_t)0x00000002U)         /* !< Secure access enabled to ADC1
                                                                                    #br#0: Non-secure access is enabled
                                                                                    #br#1: Secure access is enabled */

/* GSC_PPC_SECATTRIB_TIMER Bits */
/* GSC_PPC_SECATTRIB_TIMER[SEC_TIMA0_0] Bits */
#define GSC_PPC_SECATTRIB_TIMER_SEC_TIMA0_0_OFS  (0)                             /* !< SEC_TIMA0_0 Offset */
#define GSC_PPC_SECATTRIB_TIMER_SEC_TIMA0_0_MASK ((uint32_t)0x00000001U)         /* !< Secure access enabled to TIMA0_0
                                                                                    #br#0: Non-secure access is enabled
                                                                                    #br#1: Secure access is enabled */
/* GSC_PPC_SECATTRIB_TIMER[SEC_TIMA0_1] Bits */
#define GSC_PPC_SECATTRIB_TIMER_SEC_TIMA0_1_OFS  (1)                             /* !< SEC_TIMA0_1 Offset */
#define GSC_PPC_SECATTRIB_TIMER_SEC_TIMA0_1_MASK ((uint32_t)0x00000002U)         /* !< Secure access enabled to TIMA0_1
                                                                                    #br#0: Non-secure access is enabled
                                                                                    #br#1: Secure access is enabled */
/* GSC_PPC_SECATTRIB_TIMER[SEC_TIMG4_0] Bits */
#define GSC_PPC_SECATTRIB_TIMER_SEC_TIMG4_0_OFS  (8)                             /* !< SEC_TIMG4_0 Offset */
#define GSC_PPC_SECATTRIB_TIMER_SEC_TIMG4_0_MASK ((uint32_t)0x00000100U)         /* !< Secure access enabled to TIMG4_0
                                                                                    #br#0: Non-secure access is enabled
                                                                                    #br#1: Secure access is enabled */
/* GSC_PPC_SECATTRIB_TIMER[SEC_TIMG4_1] Bits */
#define GSC_PPC_SECATTRIB_TIMER_SEC_TIMG4_1_OFS  (9)                             /* !< SEC_TIMG4_1 Offset */
#define GSC_PPC_SECATTRIB_TIMER_SEC_TIMG4_1_MASK ((uint32_t)0x00000200U)         /* !< Secure access enabled to TIMG4_1
                                                                                    #br#0: Non-secure access is enabled
                                                                                    #br#1: Secure access is enabled */
/* GSC_PPC_SECATTRIB_TIMER[SEC_TIMG4_2] Bits */
#define GSC_PPC_SECATTRIB_TIMER_SEC_TIMG4_2_OFS  (10)                            /* !< SEC_TIMG4_2 Offset */
#define GSC_PPC_SECATTRIB_TIMER_SEC_TIMG4_2_MASK ((uint32_t)0x00000400U)         /* !< Secure access enabled to TIMG4_2
                                                                                    #br#0: Non-secure access is enabled
                                                                                    #br#1: Secure access is enabled */
/* GSC_PPC_SECATTRIB_TIMER[SEC_TIMG4_3] Bits */
#define GSC_PPC_SECATTRIB_TIMER_SEC_TIMG4_3_OFS  (11)                            /* !< SEC_TIMG4_3 Offset */
#define GSC_PPC_SECATTRIB_TIMER_SEC_TIMG4_3_MASK ((uint32_t)0x00000800U)         /* !< Secure access enabled to TIMG4_3
                                                                                    #br#0: Non-secure access is enabled
                                                                                    #br#1: Secure access is enabled */
/* GSC_PPC_SECATTRIB_TIMER[SEC_TIMG12_0] Bits */
#define GSC_PPC_SECATTRIB_TIMER_SEC_TIMG12_0_OFS (16)                            /* !< SEC_TIMG12_0 Offset */
#define GSC_PPC_SECATTRIB_TIMER_SEC_TIMG12_0_MASK ((uint32_t)0x00010000U)         /* !< Secure access enabled to TIMG12_0
                                                                                    #br#0: Non-secure access is enabled
                                                                                    #br#1: Secure access is enabled */
/* GSC_PPC_SECATTRIB_TIMER[SEC_TIMG8_0] Bits */
#define GSC_PPC_SECATTRIB_TIMER_SEC_TIMG8_0_OFS  (24)                            /* !< SEC_TIMG8_0 Offset */
#define GSC_PPC_SECATTRIB_TIMER_SEC_TIMG8_0_MASK ((uint32_t)0x01000000U)         /* !< Secure access enabled to TIMG8_0
                                                                                    #br#0: Non-secure access is enabled
                                                                                    #br#1: Secure access is enabled */
/* GSC_PPC_SECATTRIB_TIMER[SEC_TIMG8_1] Bits */
#define GSC_PPC_SECATTRIB_TIMER_SEC_TIMG8_1_OFS  (25)                            /* !< SEC_TIMG8_1 Offset */
#define GSC_PPC_SECATTRIB_TIMER_SEC_TIMG8_1_MASK ((uint32_t)0x02000000U)         /* !< Secure access enabled to TIMG8_1
                                                                                    #br#0: Non-secure access is enabled
                                                                                    #br#1: Secure access is enabled */

/* GSC_PPC_SECATTRIB_UNICOMM Bits */
/* GSC_PPC_SECATTRIB_UNICOMM[SEC_S0U1] Bits */
#define GSC_PPC_SECATTRIB_UNICOMM_SEC_S0U1_OFS   (0)                             /* !< SEC_S0U1 Offset */
#define GSC_PPC_SECATTRIB_UNICOMM_SEC_S0U1_MASK  ((uint32_t)0x00000001U)         /* !< Secure access enabled to UniComm
                                                                                    S0U1 #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */
/* GSC_PPC_SECATTRIB_UNICOMM[SEC_S0U2] Bits */
#define GSC_PPC_SECATTRIB_UNICOMM_SEC_S0U2_OFS   (1)                             /* !< SEC_S0U2 Offset */
#define GSC_PPC_SECATTRIB_UNICOMM_SEC_S0U2_MASK  ((uint32_t)0x00000002U)         /* !< Secure access enabled to UniComm
                                                                                    S0U2 #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */
/* GSC_PPC_SECATTRIB_UNICOMM[SEC_S1U0] Bits */
#define GSC_PPC_SECATTRIB_UNICOMM_SEC_S1U0_OFS   (2)                             /* !< SEC_S1U0 Offset */
#define GSC_PPC_SECATTRIB_UNICOMM_SEC_S1U0_MASK  ((uint32_t)0x00000004U)         /* !< Secure access enabled to UniComm
                                                                                    S1U0 #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */
/* GSC_PPC_SECATTRIB_UNICOMM[SEC_S1U2] Bits */
#define GSC_PPC_SECATTRIB_UNICOMM_SEC_S1U2_OFS   (3)                             /* !< SEC_S1U2 Offset */
#define GSC_PPC_SECATTRIB_UNICOMM_SEC_S1U2_MASK  ((uint32_t)0x00000008U)         /* !< Secure access enabled to UniComm
                                                                                    S1U2 #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */
/* GSC_PPC_SECATTRIB_UNICOMM[SEC_S1U3] Bits */
#define GSC_PPC_SECATTRIB_UNICOMM_SEC_S1U3_OFS   (4)                             /* !< SEC_S1U3 Offset */
#define GSC_PPC_SECATTRIB_UNICOMM_SEC_S1U3_MASK  ((uint32_t)0x00000010U)         /* !< Secure access enabled to UniComm
                                                                                    S1U3 #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */
/* GSC_PPC_SECATTRIB_UNICOMM[SEC_S1U4] Bits */
#define GSC_PPC_SECATTRIB_UNICOMM_SEC_S1U4_OFS   (5)                             /* !< SEC_S1U4 Offset */
#define GSC_PPC_SECATTRIB_UNICOMM_SEC_S1U4_MASK  ((uint32_t)0x00000020U)         /* !< Secure access enabled to UniComm
                                                                                    S1U4 #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */
/* GSC_PPC_SECATTRIB_UNICOMM[SEC_S1U5] Bits */
#define GSC_PPC_SECATTRIB_UNICOMM_SEC_S1U5_OFS   (6)                             /* !< SEC_S1U5 Offset */
#define GSC_PPC_SECATTRIB_UNICOMM_SEC_S1U5_MASK  ((uint32_t)0x00000040U)         /* !< Secure access enabled to UniComm
                                                                                    S1U5 #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */
/* GSC_PPC_SECATTRIB_UNICOMM[SEC_S2U0] Bits */
#define GSC_PPC_SECATTRIB_UNICOMM_SEC_S2U0_OFS   (7)                             /* !< SEC_S2U0 Offset */
#define GSC_PPC_SECATTRIB_UNICOMM_SEC_S2U0_MASK  ((uint32_t)0x00000080U)         /* !< Secure access enabled to UniComm
                                                                                    S2U0 #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */
/* GSC_PPC_SECATTRIB_UNICOMM[SEC_S2U1] Bits */
#define GSC_PPC_SECATTRIB_UNICOMM_SEC_S2U1_OFS   (8)                             /* !< SEC_S2U1 Offset */
#define GSC_PPC_SECATTRIB_UNICOMM_SEC_S2U1_MASK  ((uint32_t)0x00000100U)         /* !< Secure access enabled to UniComm
                                                                                    S2U1 #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */
/* GSC_PPC_SECATTRIB_UNICOMM[SEC_S2U2] Bits */
#define GSC_PPC_SECATTRIB_UNICOMM_SEC_S2U2_OFS   (9)                             /* !< SEC_S2U2 Offset */
#define GSC_PPC_SECATTRIB_UNICOMM_SEC_S2U2_MASK  ((uint32_t)0x00000200U)         /* !< Secure access enabled to UniComm
                                                                                    S2U2 #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */
/* GSC_PPC_SECATTRIB_UNICOMM[SEC_S2U3] Bits */
#define GSC_PPC_SECATTRIB_UNICOMM_SEC_S2U3_OFS   (10)                            /* !< SEC_S2U3 Offset */
#define GSC_PPC_SECATTRIB_UNICOMM_SEC_S2U3_MASK  ((uint32_t)0x00000400U)         /* !< Secure access enabled to UniComm
                                                                                    S2U3 #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */

/* GSC_PPC_SECATTRIB_GPIO Bits */
/* GSC_PPC_SECATTRIB_GPIO[SEC_GPIOA] Bits */
#define GSC_PPC_SECATTRIB_GPIO_SEC_GPIOA_OFS     (0)                             /* !< SEC_GPIOA Offset */
#define GSC_PPC_SECATTRIB_GPIO_SEC_GPIOA_MASK    ((uint32_t)0x00000001U)         /* !< Secure access enabled to GPIO A
                                                                                    #br#0: Non-secure access is enabled
                                                                                    #br#1: Secure access is enabled */
/* GSC_PPC_SECATTRIB_GPIO[SEC_GPIOB] Bits */
#define GSC_PPC_SECATTRIB_GPIO_SEC_GPIOB_OFS     (1)                             /* !< SEC_GPIOB Offset */
#define GSC_PPC_SECATTRIB_GPIO_SEC_GPIOB_MASK    ((uint32_t)0x00000002U)         /* !< Secure access enabled to GPIO B
                                                                                    #br#0: Non-secure access is enabled
                                                                                    #br#1: Secure access is enabled */
/* GSC_PPC_SECATTRIB_GPIO[SEC_GPIOC] Bits */
#define GSC_PPC_SECATTRIB_GPIO_SEC_GPIOC_OFS     (2)                             /* !< SEC_GPIOC Offset */
#define GSC_PPC_SECATTRIB_GPIO_SEC_GPIOC_MASK    ((uint32_t)0x00000004U)         /* !< Secure access enabled to GPIO C
                                                                                    #br#0: Non-secure access is enabled
                                                                                    #br#1: Secure access is enabled */

/* GSC_PPC_SECATTRIB_MCAN Bits */
/* GSC_PPC_SECATTRIB_MCAN[SEC_MCAN0] Bits */
#define GSC_PPC_SECATTRIB_MCAN_SEC_MCAN0_OFS     (0)                             /* !< SEC_MCAN0 Offset */
#define GSC_PPC_SECATTRIB_MCAN_SEC_MCAN0_MASK    ((uint32_t)0x00000001U)         /* !< Secure access enabled to MCAN 0
                                                                                    #br#0: Non-secure access is enabled
                                                                                    #br#1: Secure access is enabled */
/* GSC_PPC_SECATTRIB_MCAN[SEC_MCAN1] Bits */
#define GSC_PPC_SECATTRIB_MCAN_SEC_MCAN1_OFS     (1)                             /* !< SEC_MCAN1 Offset */
#define GSC_PPC_SECATTRIB_MCAN_SEC_MCAN1_MASK    ((uint32_t)0x00000002U)         /* !< Secure access enabled to MCAN 1
                                                                                    #br#0: Non-secure access is enabled
                                                                                    #br#1: Secure access is enabled */

/* GSC_PPC_SECATTRIB_I2S Bits */
/* GSC_PPC_SECATTRIB_I2S[SEC_I2S0] Bits */
#define GSC_PPC_SECATTRIB_I2S_SEC_I2S0_OFS       (0)                             /* !< SEC_I2S0 Offset */
#define GSC_PPC_SECATTRIB_I2S_SEC_I2S0_MASK      ((uint32_t)0x00000001U)         /* !< Secure access enabled to I2S 0
                                                                                    #br#0: Non-secure access is enabled
                                                                                    #br#1: Secure access is enabled */
/* GSC_PPC_SECATTRIB_I2S[SEC_I2S1] Bits */
#define GSC_PPC_SECATTRIB_I2S_SEC_I2S1_OFS       (1)                             /* !< SEC_I2S1 Offset */
#define GSC_PPC_SECATTRIB_I2S_SEC_I2S1_MASK      ((uint32_t)0x00000002U)         /* !< Secure access enabled to I2S 1
                                                                                    #br#0: Non-secure access is enabled
                                                                                    #br#1: Secure access is enabled */

/* GSC_PPC_SECATTRIB_ACOMP Bits */
/* GSC_PPC_SECATTRIB_ACOMP[SEC_ACOMP0] Bits */
#define GSC_PPC_SECATTRIB_ACOMP_SEC_ACOMP0_OFS   (0)                             /* !< SEC_ACOMP0 Offset */
#define GSC_PPC_SECATTRIB_ACOMP_SEC_ACOMP0_MASK  ((uint32_t)0x00000001U)         /* !< Secure access enabled to Comparator
                                                                                    0 #br#0: Non-secure access is enabled
                                                                                    #br#1: Secure access is enabled */
/* GSC_PPC_SECATTRIB_ACOMP[SEC_ACOMP1] Bits */
#define GSC_PPC_SECATTRIB_ACOMP_SEC_ACOMP1_OFS   (1)                             /* !< SEC_ACOMP1 Offset */
#define GSC_PPC_SECATTRIB_ACOMP_SEC_ACOMP1_MASK  ((uint32_t)0x00000002U)         /* !< Secure access enabled to Comparator
                                                                                    1 #br#0: Non-secure access is enabled
                                                                                    #br#1: Secure access is enabled */

/* GSC_PPC_SECATTRIB_WDT Bits */
/* GSC_PPC_SECATTRIB_WDT[SEC_WWDT] Bits */
#define GSC_PPC_SECATTRIB_WDT_SEC_WWDT_OFS       (0)                             /* !< SEC_WWDT Offset */
#define GSC_PPC_SECATTRIB_WDT_SEC_WWDT_MASK      ((uint32_t)0x00000001U)         /* !< Secure access enabled to Windowed
                                                                                    Watchdog #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */

/* GSC_PPC_SECATTRIB_LFSS Bits */
/* GSC_PPC_SECATTRIB_LFSS[SEC_LFSS] Bits */
#define GSC_PPC_SECATTRIB_LFSS_SEC_LFSS_OFS      (0)                             /* !< SEC_LFSS Offset */
#define GSC_PPC_SECATTRIB_LFSS_SEC_LFSS_MASK     ((uint32_t)0x00000001U)         /* !< Secure access enabled to LFSS
                                                                                    (including peripherals inside LFSS
                                                                                    e.g. IWDT) #br#0: Non-secure access
                                                                                    is enabled #br#1: Secure access is
                                                                                    enabled */

/* GSC_PPC_SECATTRIB_CRC Bits */
/* GSC_PPC_SECATTRIB_CRC[SEC_CRC] Bits */
#define GSC_PPC_SECATTRIB_CRC_SEC_CRC_OFS        (0)                             /* !< SEC_CRC Offset */
#define GSC_PPC_SECATTRIB_CRC_SEC_CRC_MASK       ((uint32_t)0x00000001U)         /* !< Secure access enabled to CRC #br#0:
                                                                                    Non-secure access is enabled #br#1:
                                                                                    Secure access is enabled */

/* GSC_PPC_SECATTRIB_AES Bits */
/* GSC_PPC_SECATTRIB_AES[SEC_AES] Bits */
#define GSC_PPC_SECATTRIB_AES_SEC_AES_OFS        (0)                             /* !< SEC_AES Offset */
#define GSC_PPC_SECATTRIB_AES_SEC_AES_MASK       ((uint32_t)0x00000001U)         /* !< Secure access enabled to AES #br#0:
                                                                                    Non-secure access is enabled #br#1:
                                                                                    Secure access is enabled */

/* GSC_PPC_SECATTRIB_SHA Bits */
/* GSC_PPC_SECATTRIB_SHA[SEC_SHA] Bits */
#define GSC_PPC_SECATTRIB_SHA_SEC_SHA_OFS        (0)                             /* !< SEC_SHA Offset */
#define GSC_PPC_SECATTRIB_SHA_SEC_SHA_MASK       ((uint32_t)0x00000001U)         /* !< Secure access enabled to SHA #br#0:
                                                                                    Non-secure access is enabled #br#1:
                                                                                    Secure access is enabled */

/* GSC_PPC_SECATTRIB_PKA Bits */
/* GSC_PPC_SECATTRIB_PKA[SEC_PKA] Bits */
#define GSC_PPC_SECATTRIB_PKA_SEC_PKA_OFS        (0)                             /* !< SEC_PKA Offset */
#define GSC_PPC_SECATTRIB_PKA_SEC_PKA_MASK       ((uint32_t)0x00000001U)         /* !< Secure access enabled to PKA #br#0:
                                                                                    Non-secure access is enabled #br#1:
                                                                                    Secure access is enabled */

