TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gsc.h
/* GSC_PPC_SECATTRIB_IOMUX Bits */
/* GSC_PPC_SECATTRIB_IOMUX[SEC_IOMUX] Bits */
#define GSC_PPC_SECATTRIB_IOMUX_SEC_IOMUX_OFS    (0)                             /* !< SEC_IOMUX Offset */
#define GSC_PPC_SECATTRIB_IOMUX_SEC_IOMUX_MASK   ((uint32_t)0x00000001U)         /* !< Secure access enabled to IOMUX
                                                                                    #br#0: Non-secure access is enabled
                                                                                    #br#1: Secure access is enabled */

/* GSC_PPC_SECATTRIB_QSPI Bits */
/* GSC_PPC_SECATTRIB_QSPI[SEC_QSPI] Bits */
#define GSC_PPC_SECATTRIB_QSPI_SEC_QSPI_OFS      (0)                             /* !< SEC_QSPI Offset */
#define GSC_PPC_SECATTRIB_QSPI_SEC_QSPI_MASK     ((uint32_t)0x00000001U)         /* !< Secure access enabled to QSPI
                                                                                    #br#0: Non-secure access is enabled
                                                                                    #br#1: Secure access is enabled */

/* GSC_PPC_SECATTRIB_TRNG Bits */
/* GSC_PPC_SECATTRIB_TRNG[SEC_TRNG] Bits */
#define GSC_PPC_SECATTRIB_TRNG_SEC_TRNG_OFS      (0)                             /* !< SEC_TRNG Offset */
#define GSC_PPC_SECATTRIB_TRNG_SEC_TRNG_MASK     ((uint32_t)0x00000001U)         /* !< Secure access enabled to TRNG
                                                                                    #br#0: Non-secure access is enabled
                                                                                    #br#1: Secure access is enabled */

/* GSC_PPC_SECATTRIB_DEBUGSS Bits */
/* GSC_PPC_SECATTRIB_DEBUGSS[SEC_DEBUGSS] Bits */
#define GSC_PPC_SECATTRIB_DEBUGSS_SEC_DEBUGSS_OFS (0)                             /* !< SEC_DEBUGSS Offset */
#define GSC_PPC_SECATTRIB_DEBUGSS_SEC_DEBUGSS_MASK ((uint32_t)0x00000001U)         /* !< Secure access enabled to DEBUGSS
                                                                                    #br#0: Non-secure access is enabled
                                                                                    #br#1: Secure access is enabled */

/* GSC_PPC_SECATTRIB_VREF Bits */
/* GSC_PPC_SECATTRIB_VREF[SEC_VREF] Bits */
#define GSC_PPC_SECATTRIB_VREF_SEC_VREF_OFS      (0)                             /* !< SEC_VREF Offset */
#define GSC_PPC_SECATTRIB_VREF_SEC_VREF_MASK     ((uint32_t)0x00000001U)         /* !< Secure access enabled to VREF
                                                                                    #br#0: Non-secure access is enabled
                                                                                    #br#1: Secure access is enabled */

/* GSC_PPC_SECATTRIB_KEYSTORECTL Bits */
/* GSC_PPC_SECATTRIB_KEYSTORECTL[SEC_KEYSTORECTL] Bits */
#define GSC_PPC_SECATTRIB_KEYSTORECTL_SEC_KEYSTORECTL_OFS (0)                             /* !< SEC_KEYSTORECTL Offset */
#define GSC_PPC_SECATTRIB_KEYSTORECTL_SEC_KEYSTORECTL_MASK ((uint32_t)0x00000001U)         /* !< Secure access enabled to
                                                                                    KEYSTORECTL #br#0: Non-secure access
                                                                                    is enabled #br#1: Secure access is
                                                                                    enabled */

/* GSC_PPC_SECATTRIB_EAM Bits */
/* GSC_PPC_SECATTRIB_EAM[SEC_EAM] Bits */
#define GSC_PPC_SECATTRIB_EAM_SEC_EAM_OFS        (0)                             /* !< SEC_EAM Offset */
#define GSC_PPC_SECATTRIB_EAM_SEC_EAM_MASK       ((uint32_t)0x00000001U)         /* !< Secure access enabled to EAM #br#0:
                                                                                    Non-secure access is enabled #br#1:
                                                                                    Secure access is enabled */

/* GSC_PPC_SECATTRIB_WUC Bits */
/* GSC_PPC_SECATTRIB_WUC[SEC_WUC] Bits */
#define GSC_PPC_SECATTRIB_WUC_SEC_WUC_OFS        (0)                             /* !< SEC_WUC Offset */
#define GSC_PPC_SECATTRIB_WUC_SEC_WUC_MASK       ((uint32_t)0x00000001U)         /* !< Secure access enabled to WUC #br#0:
                                                                                    Non-secure access is enabled #br#1:
                                                                                    Secure access is enabled */

/* GSC_PPC_SECATTRIB_FRIREGS Bits */
/* GSC_PPC_SECATTRIB_FRIREGS[SEC_FRIREGS] Bits */
#define GSC_PPC_SECATTRIB_FRIREGS_SEC_FRIREGS_OFS (0)                             /* !< SEC_FRIREGS Offset */
#define GSC_PPC_SECATTRIB_FRIREGS_SEC_FRIREGS_MASK ((uint32_t)0x00000001U)         /* !< Secure access enabled to FRIREGS
                                                                                    #br#0: Non-secure access is enabled
                                                                                    #br#1: Secure access is enabled */

/* GSC_PPC_SECATTRIB_MEMCFG Bits */
/* GSC_PPC_SECATTRIB_MEMCFG[SEC_MEMCFG] Bits */
#define GSC_PPC_SECATTRIB_MEMCFG_SEC_MEMCFG_OFS  (0)                             /* !< SEC_MEMCFG Offset */
#define GSC_PPC_SECATTRIB_MEMCFG_SEC_MEMCFG_MASK ((uint32_t)0x00000001U)         /* !< Secure access enabled to MEMCFG
                                                                                    #br#0: Non-secure access is enabled
                                                                                    #br#1: Secure access is enabled */

/* GSC_PPC_SECATTRIB_SYSCTL Bits */
/* GSC_PPC_SECATTRIB_SYSCTL[SEC_SYSCTL] Bits */
#define GSC_PPC_SECATTRIB_SYSCTL_SEC_SYSCTL_OFS  (0)                             /* !< SEC_SYSCTL Offset */
#define GSC_PPC_SECATTRIB_SYSCTL_SEC_SYSCTL_MASK ((uint32_t)0x00000001U)         /* !< Secure access enabled to SYSCTL
                                                                                    #br#0: Non-secure access is enabled
                                                                                    #br#1: Secure access is enabled */

/* GSC_PPC_PRIVATTRIB_SYSCTL Bits */
/* GSC_PPC_PRIVATTRIB_SYSCTL[PRIV_SYSCTL] Bits */
#define GSC_PPC_PRIVATTRIB_SYSCTL_PRIV_SYSCTL_OFS (0)                             /* !< PRIV_SYSCTL Offset */
#define GSC_PPC_PRIVATTRIB_SYSCTL_PRIV_SYSCTL_MASK ((uint32_t)0x00000001U)         /* !< Privilege access enabled to SYSCTL
                                                                                    #br#0: Non-Privilege access is
                                                                                    enabled #br#1: Privilege access is
                                                                                    enabled */

/* GSC_PPC_SECATTRIB_DMA Bits */
/* GSC_PPC_SECATTRIB_DMA[SEC_DMA0] Bits */
#define GSC_PPC_SECATTRIB_DMA_SEC_DMA0_OFS       (0)                             /* !< SEC_DMA0 Offset */
#define GSC_PPC_SECATTRIB_DMA_SEC_DMA0_MASK      ((uint32_t)0x00000001U)         /* !< Secure access enabled to DMA0
                                                                                    #br#0: Non-secure access is enabled
                                                                                    #br#1: Secure access is enabled */
/* GSC_PPC_SECATTRIB_DMA[SEC_DMA1] Bits */
#define GSC_PPC_SECATTRIB_DMA_SEC_DMA1_OFS       (1)                             /* !< SEC_DMA1 Offset */
#define GSC_PPC_SECATTRIB_DMA_SEC_DMA1_MASK      ((uint32_t)0x00000002U)         /* !< Secure access enabled to DMA1
                                                                                    #br#0: Non-secure access is enabled
                                                                                    #br#1: Secure access is enabled */

