TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gsc.h
/* GSC_PPC_PRIVATTRIB_DMA Bits */
/* GSC_PPC_PRIVATTRIB_DMA[PRIV_DMA0] Bits */
#define GSC_PPC_PRIVATTRIB_DMA_PRIV_DMA0_OFS     (0)                             /* !< PRIV_DMA0 Offset */
#define GSC_PPC_PRIVATTRIB_DMA_PRIV_DMA0_MASK    ((uint32_t)0x00000001U)         /* !< Privilege access enabled to DMA0
                                                                                    #br#0: Non-Privilege access is
                                                                                    enabled #br#1: Privilege access is
                                                                                    enabled */
/* GSC_PPC_PRIVATTRIB_DMA[PRIV_DMA1] Bits */
#define GSC_PPC_PRIVATTRIB_DMA_PRIV_DMA1_OFS     (1)                             /* !< PRIV_DMA1 Offset */
#define GSC_PPC_PRIVATTRIB_DMA_PRIV_DMA1_MASK    ((uint32_t)0x00000002U)         /* !< Privilege access enabled to DMA1
                                                                                    #br#0: Non-Privilege access is
                                                                                    enabled #br#1: Privilege access is
                                                                                    enabled */

/* GSC_PPC_SECATTRIB_GSC Bits */
/* GSC_PPC_SECATTRIB_GSC[SEC_GSC] Bits */
#define GSC_PPC_SECATTRIB_GSC_SEC_GSC_OFS        (0)                             /* !< SEC_GSC Offset */
#define GSC_PPC_SECATTRIB_GSC_SEC_GSC_MASK       ((uint32_t)0x00000001U)         /* !< Secure access enabled to GSC #br#0:
                                                                                    Non-secure access is enabled #br#1:
                                                                                    Secure access is enabled */

/* GSC_PPC_PRIVATTRIB_GSC Bits */
/* GSC_PPC_PRIVATTRIB_GSC[PRIV_GSC] Bits */
#define GSC_PPC_PRIVATTRIB_GSC_PRIV_GSC_OFS      (0)                             /* !< PRIV_GSC Offset */
#define GSC_PPC_PRIVATTRIB_GSC_PRIV_GSC_MASK     ((uint32_t)0x00000001U)         /* !< Privilege access enabled to GSC
                                                                                    #br#0: Non-Privilege access is
                                                                                    enabled #br#1: Privilege access is
                                                                                    enabled */

/* GSC_PPC_SPARERW_GSC Bits */
/* GSC_PPC_SPARERW_GSC[ZERO_PKASRAM] Bits */
#define GSC_PPC_SPARERW_GSC_ZERO_PKASRAM_OFS     (0)                             /* !< ZERO_PKASRAM Offset */
#define GSC_PPC_SPARERW_GSC_ZERO_PKASRAM_MASK    ((uint32_t)0x00000001U)         /* !< Controls the zeroization of PKA
                                                                                    SRAM #br#0: PKA SRAM zeroization is
                                                                                    enabled #br#1: PKA SRAM zeroization
                                                                                    is disabled */

/* GSC_PPC_SPARERW1S_GSC Bits */
/* GSC_PPC_SPARERW1S_GSC[SPARE] Bits */
#define GSC_PPC_SPARERW1S_GSC_SPARE_OFS          (0)                             /* !< SPARE Offset */
#define GSC_PPC_SPARERW1S_GSC_SPARE_MASK         ((uint32_t)0xFFFFFFFFU)         /* !< Spare reserved */

/* GSC_SPC_SECATTRIB0 Bits */
/* GSC_SPC_SECATTRIB0[C0B0_512B] Bits */
#define GSC_SPC_SECATTRIB0_C0B0_512B_OFS         (0)                             /* !< C0B0_512B Offset */
#define GSC_SPC_SECATTRIB0_C0B0_512B_MASK        ((uint32_t)0x00000001U)         /* !< Secure access enabled to 1st 512
                                                                                    byte in chunk-0 #br#0: Non-secure
                                                                                    access is enabled #br#1: Secure
                                                                                    access is enabled */
/* GSC_SPC_SECATTRIB0[C0B1_512B] Bits */
#define GSC_SPC_SECATTRIB0_C0B1_512B_OFS         (1)                             /* !< C0B1_512B Offset */
#define GSC_SPC_SECATTRIB0_C0B1_512B_MASK        ((uint32_t)0x00000002U)         /* !< Secure access enabled to 2nd 512
                                                                                    byte in chunk-0 #br#0: Non-secure
                                                                                    access is enabled #br#1: Secure
                                                                                    access is enabled */
/* GSC_SPC_SECATTRIB0[C0B0_1KB] Bits */
#define GSC_SPC_SECATTRIB0_C0B0_1KB_OFS          (2)                             /* !< C0B0_1KB Offset */
#define GSC_SPC_SECATTRIB0_C0B0_1KB_MASK         ((uint32_t)0x00000004U)         /* !< Secure access enabled to 1KB in
                                                                                    chunk-0 #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */
/* GSC_SPC_SECATTRIB0[C0B0_2KB] Bits */
#define GSC_SPC_SECATTRIB0_C0B0_2KB_OFS          (3)                             /* !< C0B0_2KB Offset */
#define GSC_SPC_SECATTRIB0_C0B0_2KB_MASK         ((uint32_t)0x00000008U)         /* !< Secure access enabled to 2KB in
                                                                                    chunk-0 #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */
/* GSC_SPC_SECATTRIB0[C0B0_4KB] Bits */
#define GSC_SPC_SECATTRIB0_C0B0_4KB_OFS          (4)                             /* !< C0B0_4KB Offset */
#define GSC_SPC_SECATTRIB0_C0B0_4KB_MASK         ((uint32_t)0x00000010U)         /* !< Secure access enabled to 1st 4KB in
                                                                                    chunk-0 #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */
/* GSC_SPC_SECATTRIB0[C0B1_4KB] Bits */
#define GSC_SPC_SECATTRIB0_C0B1_4KB_OFS          (5)                             /* !< C0B1_4KB Offset */
#define GSC_SPC_SECATTRIB0_C0B1_4KB_MASK         ((uint32_t)0x00000020U)         /* !< Secure access enabled to 2nd 4KB in
                                                                                    chunk-0 #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */
/* GSC_SPC_SECATTRIB0[C0B2_4KB] Bits */
#define GSC_SPC_SECATTRIB0_C0B2_4KB_OFS          (6)                             /* !< C0B2_4KB Offset */
#define GSC_SPC_SECATTRIB0_C0B2_4KB_MASK         ((uint32_t)0x00000040U)         /* !< Secure access enabled to 3rd 4KB in
                                                                                    chunk-0 #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */
/* GSC_SPC_SECATTRIB0[C1B0_512B] Bits */
#define GSC_SPC_SECATTRIB0_C1B0_512B_OFS         (8)                             /* !< C1B0_512B Offset */
#define GSC_SPC_SECATTRIB0_C1B0_512B_MASK        ((uint32_t)0x00000100U)         /* !< Secure access enabled to 1st 512
                                                                                    byte in chunk-1 #br#0: Non-secure
                                                                                    access is enabled #br#1: Secure
                                                                                    access is enabled */
/* GSC_SPC_SECATTRIB0[C1B1_512B] Bits */
#define GSC_SPC_SECATTRIB0_C1B1_512B_OFS         (9)                             /* !< C1B1_512B Offset */
#define GSC_SPC_SECATTRIB0_C1B1_512B_MASK        ((uint32_t)0x00000200U)         /* !< Secure access enabled to 2nd 512
                                                                                    byte in chunk-1 #br#0: Non-secure
                                                                                    access is enabled #br#1: Secure
                                                                                    access is enabled */
/* GSC_SPC_SECATTRIB0[C1B0_1KB] Bits */
#define GSC_SPC_SECATTRIB0_C1B0_1KB_OFS          (10)                            /* !< C1B0_1KB Offset */
#define GSC_SPC_SECATTRIB0_C1B0_1KB_MASK         ((uint32_t)0x00000400U)         /* !< Secure access enabled to 1KB in
                                                                                    chunk-1 #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */
/* GSC_SPC_SECATTRIB0[C1B0_2KB] Bits */
#define GSC_SPC_SECATTRIB0_C1B0_2KB_OFS          (11)                            /* !< C1B0_2KB Offset */
#define GSC_SPC_SECATTRIB0_C1B0_2KB_MASK         ((uint32_t)0x00000800U)         /* !< Secure access enabled to 2KB in
                                                                                    chunk-1 #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */
/* GSC_SPC_SECATTRIB0[C1B0_4KB] Bits */
#define GSC_SPC_SECATTRIB0_C1B0_4KB_OFS          (12)                            /* !< C1B0_4KB Offset */
#define GSC_SPC_SECATTRIB0_C1B0_4KB_MASK         ((uint32_t)0x00001000U)         /* !< Secure access enabled to 1st 4KB in
                                                                                    chunk-1 #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */
/* GSC_SPC_SECATTRIB0[C1B1_4KB] Bits */
#define GSC_SPC_SECATTRIB0_C1B1_4KB_OFS          (13)                            /* !< C1B1_4KB Offset */
#define GSC_SPC_SECATTRIB0_C1B1_4KB_MASK         ((uint32_t)0x00002000U)         /* !< Secure access enabled to 2nd 4KB in
                                                                                    chunk-1 #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */
/* GSC_SPC_SECATTRIB0[C1B2_4KB] Bits */
#define GSC_SPC_SECATTRIB0_C1B2_4KB_OFS          (14)                            /* !< C1B2_4KB Offset */
#define GSC_SPC_SECATTRIB0_C1B2_4KB_MASK         ((uint32_t)0x00004000U)         /* !< Secure access enabled to 3rd 4KB in
                                                                                    chunk-1 #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */
/* GSC_SPC_SECATTRIB0[C2B0_512B] Bits */
#define GSC_SPC_SECATTRIB0_C2B0_512B_OFS         (16)                            /* !< C2B0_512B Offset */
#define GSC_SPC_SECATTRIB0_C2B0_512B_MASK        ((uint32_t)0x00010000U)         /* !< Secure access enabled to 1st 512
                                                                                    byte in chunk-2 #br#0: Non-secure
                                                                                    access is enabled #br#1: Secure
                                                                                    access is enabled */
/* GSC_SPC_SECATTRIB0[C2B1_512B] Bits */
#define GSC_SPC_SECATTRIB0_C2B1_512B_OFS         (17)                            /* !< C2B1_512B Offset */
#define GSC_SPC_SECATTRIB0_C2B1_512B_MASK        ((uint32_t)0x00020000U)         /* !< Secure access enabled to 2nd 512
                                                                                    byte in chunk-2 #br#0: Non-secure
                                                                                    access is enabled #br#1: Secure
                                                                                    access is enabled */
/* GSC_SPC_SECATTRIB0[C2B0_1KB] Bits */
#define GSC_SPC_SECATTRIB0_C2B0_1KB_OFS          (18)                            /* !< C2B0_1KB Offset */
#define GSC_SPC_SECATTRIB0_C2B0_1KB_MASK         ((uint32_t)0x00040000U)         /* !< Secure access enabled to 1KB in
                                                                                    chunk-2 #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */
/* GSC_SPC_SECATTRIB0[C2B0_2KB] Bits */
#define GSC_SPC_SECATTRIB0_C2B0_2KB_OFS          (19)                            /* !< C2B0_2KB Offset */
#define GSC_SPC_SECATTRIB0_C2B0_2KB_MASK         ((uint32_t)0x00080000U)         /* !< Secure access enabled to 2KB in
                                                                                    chunk-2 #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */
/* GSC_SPC_SECATTRIB0[C2B0_4KB] Bits */
#define GSC_SPC_SECATTRIB0_C2B0_4KB_OFS          (20)                            /* !< C2B0_4KB Offset */
#define GSC_SPC_SECATTRIB0_C2B0_4KB_MASK         ((uint32_t)0x00100000U)         /* !< Secure access enabled to 1st 4KB in
                                                                                    chunk-2 #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */
/* GSC_SPC_SECATTRIB0[C2B1_4KB] Bits */
#define GSC_SPC_SECATTRIB0_C2B1_4KB_OFS          (21)                            /* !< C2B1_4KB Offset */
#define GSC_SPC_SECATTRIB0_C2B1_4KB_MASK         ((uint32_t)0x00200000U)         /* !< Secure access enabled to 2nd 4KB in
                                                                                    chunk-2 #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */
/* GSC_SPC_SECATTRIB0[C2B2_4KB] Bits */
#define GSC_SPC_SECATTRIB0_C2B2_4KB_OFS          (22)                            /* !< C2B2_4KB Offset */
#define GSC_SPC_SECATTRIB0_C2B2_4KB_MASK         ((uint32_t)0x00400000U)         /* !< Secure access enabled to 3rd 4KB in
                                                                                    chunk-2 #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */
/* GSC_SPC_SECATTRIB0[C3B0_512B] Bits */
#define GSC_SPC_SECATTRIB0_C3B0_512B_OFS         (24)                            /* !< C3B0_512B Offset */
#define GSC_SPC_SECATTRIB0_C3B0_512B_MASK        ((uint32_t)0x01000000U)         /* !< Secure access enabled to 1st 512
                                                                                    byte in chunk-3 #br#0: Non-secure
                                                                                    access is enabled #br#1: Secure
                                                                                    access is enabled */
/* GSC_SPC_SECATTRIB0[C3B1_512B] Bits */
#define GSC_SPC_SECATTRIB0_C3B1_512B_OFS         (25)                            /* !< C3B1_512B Offset */
#define GSC_SPC_SECATTRIB0_C3B1_512B_MASK        ((uint32_t)0x02000000U)         /* !< Secure access enabled to 2nd 512
                                                                                    byte in chunk-3 #br#0: Non-secure
                                                                                    access is enabled #br#1: Secure
                                                                                    access is enabled */
/* GSC_SPC_SECATTRIB0[C3B0_1KB] Bits */
#define GSC_SPC_SECATTRIB0_C3B0_1KB_OFS          (26)                            /* !< C3B0_1KB Offset */
#define GSC_SPC_SECATTRIB0_C3B0_1KB_MASK         ((uint32_t)0x04000000U)         /* !< Secure access enabled to 1KB in
                                                                                    chunk-3 #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */
/* GSC_SPC_SECATTRIB0[C3B0_2KB] Bits */
#define GSC_SPC_SECATTRIB0_C3B0_2KB_OFS          (27)                            /* !< C3B0_2KB Offset */
#define GSC_SPC_SECATTRIB0_C3B0_2KB_MASK         ((uint32_t)0x08000000U)         /* !< Secure access enabled to 2KB in
                                                                                    chunk-3 #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */
/* GSC_SPC_SECATTRIB0[C3B0_4KB] Bits */
#define GSC_SPC_SECATTRIB0_C3B0_4KB_OFS          (28)                            /* !< C3B0_4KB Offset */
#define GSC_SPC_SECATTRIB0_C3B0_4KB_MASK         ((uint32_t)0x10000000U)         /* !< Secure access enabled to 1st 4KB in
                                                                                    chunk-3 #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */
/* GSC_SPC_SECATTRIB0[C3B1_4KB] Bits */
#define GSC_SPC_SECATTRIB0_C3B1_4KB_OFS          (29)                            /* !< C3B1_4KB Offset */
#define GSC_SPC_SECATTRIB0_C3B1_4KB_MASK         ((uint32_t)0x20000000U)         /* !< Secure access enabled to 2nd 4KB in
                                                                                    chunk-3 #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */
/* GSC_SPC_SECATTRIB0[C3B2_4KB] Bits */
#define GSC_SPC_SECATTRIB0_C3B2_4KB_OFS          (30)                            /* !< C3B2_4KB Offset */
#define GSC_SPC_SECATTRIB0_C3B2_4KB_MASK         ((uint32_t)0x40000000U)         /* !< Secure access enabled to 3rd 4KB in
                                                                                    chunk-3 #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */

