TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gsc.h
/* GSC_SPC_PRIVATTRIB3 Bits */
/* GSC_SPC_PRIVATTRIB3[C0B0_512B] Bits */
#define GSC_SPC_PRIVATTRIB3_C0B0_512B_OFS        (0)                             /* !< C0B0_512B Offset */
#define GSC_SPC_PRIVATTRIB3_C0B0_512B_MASK       ((uint32_t)0x00000001U)         /* !< privilege access enabled to 1st 512
                                                                                    byte in chunk-0 #br#0: Non-privilege
                                                                                    access is enabled #br#1: privilege
                                                                                    access is enabled */
/* GSC_SPC_PRIVATTRIB3[C0B1_512B] Bits */
#define GSC_SPC_PRIVATTRIB3_C0B1_512B_OFS        (1)                             /* !< C0B1_512B Offset */
#define GSC_SPC_PRIVATTRIB3_C0B1_512B_MASK       ((uint32_t)0x00000002U)         /* !< privilege access enabled to 2nd 512
                                                                                    byte in chunk-0 #br#0: Non-privilege
                                                                                    access is enabled #br#1: privilege
                                                                                    access is enabled */
/* GSC_SPC_PRIVATTRIB3[C0B0_1KB] Bits */
#define GSC_SPC_PRIVATTRIB3_C0B0_1KB_OFS         (2)                             /* !< C0B0_1KB Offset */
#define GSC_SPC_PRIVATTRIB3_C0B0_1KB_MASK        ((uint32_t)0x00000004U)         /* !< privilege access enabled to 1KB in
                                                                                    chunk-0 #br#0: Non-privilege access
                                                                                    is enabled #br#1: privilege access is
                                                                                    enabled */
/* GSC_SPC_PRIVATTRIB3[C0B0_2KB] Bits */
#define GSC_SPC_PRIVATTRIB3_C0B0_2KB_OFS         (3)                             /* !< C0B0_2KB Offset */
#define GSC_SPC_PRIVATTRIB3_C0B0_2KB_MASK        ((uint32_t)0x00000008U)         /* !< privilege access enabled to 2KB in
                                                                                    chunk-0 #br#0: Non-privilege access
                                                                                    is enabled #br#1: privilege access is
                                                                                    enabled */
/* GSC_SPC_PRIVATTRIB3[C0B0_4KB] Bits */
#define GSC_SPC_PRIVATTRIB3_C0B0_4KB_OFS         (4)                             /* !< C0B0_4KB Offset */
#define GSC_SPC_PRIVATTRIB3_C0B0_4KB_MASK        ((uint32_t)0x00000010U)         /* !< privilege access enabled to 1st 4KB
                                                                                    in chunk-0 #br#0: Non-privilege
                                                                                    access is enabled #br#1: privilege
                                                                                    access is enabled */
/* GSC_SPC_PRIVATTRIB3[C0B1_4KB] Bits */
#define GSC_SPC_PRIVATTRIB3_C0B1_4KB_OFS         (5)                             /* !< C0B1_4KB Offset */
#define GSC_SPC_PRIVATTRIB3_C0B1_4KB_MASK        ((uint32_t)0x00000020U)         /* !< privilege access enabled to 2nd 4KB
                                                                                    in chunk-0 #br#0: Non-privilege
                                                                                    access is enabled #br#1: privilege
                                                                                    access is enabled */
/* GSC_SPC_PRIVATTRIB3[C0B2_4KB] Bits */
#define GSC_SPC_PRIVATTRIB3_C0B2_4KB_OFS         (6)                             /* !< C0B2_4KB Offset */
#define GSC_SPC_PRIVATTRIB3_C0B2_4KB_MASK        ((uint32_t)0x00000040U)         /* !< privilege access enabled to 3rd 4KB
                                                                                    in chunk-0 #br#0: Non-privilege
                                                                                    access is enabled #br#1: privilege
                                                                                    access is enabled */
/* GSC_SPC_PRIVATTRIB3[C1B0_512B] Bits */
#define GSC_SPC_PRIVATTRIB3_C1B0_512B_OFS        (8)                             /* !< C1B0_512B Offset */
#define GSC_SPC_PRIVATTRIB3_C1B0_512B_MASK       ((uint32_t)0x00000100U)         /* !< privilege access enabled to 1st 512
                                                                                    byte in chunk-1 #br#0: Non-privilege
                                                                                    access is enabled #br#1: privilege
                                                                                    access is enabled */
/* GSC_SPC_PRIVATTRIB3[C1B1_512B] Bits */
#define GSC_SPC_PRIVATTRIB3_C1B1_512B_OFS        (9)                             /* !< C1B1_512B Offset */
#define GSC_SPC_PRIVATTRIB3_C1B1_512B_MASK       ((uint32_t)0x00000200U)         /* !< privilege access enabled to 2nd 512
                                                                                    byte in chunk-1 #br#0: Non-privilege
                                                                                    access is enabled #br#1: privilege
                                                                                    access is enabled */
/* GSC_SPC_PRIVATTRIB3[C1B0_1KB] Bits */
#define GSC_SPC_PRIVATTRIB3_C1B0_1KB_OFS         (10)                            /* !< C1B0_1KB Offset */
#define GSC_SPC_PRIVATTRIB3_C1B0_1KB_MASK        ((uint32_t)0x00000400U)         /* !< privilege access enabled to 1KB in
                                                                                    chunk-1 #br#0: Non-privilege access
                                                                                    is enabled #br#1: privilege access is
                                                                                    enabled */
/* GSC_SPC_PRIVATTRIB3[C1B0_2KB] Bits */
#define GSC_SPC_PRIVATTRIB3_C1B0_2KB_OFS         (11)                            /* !< C1B0_2KB Offset */
#define GSC_SPC_PRIVATTRIB3_C1B0_2KB_MASK        ((uint32_t)0x00000800U)         /* !< privilege access enabled to 2KB in
                                                                                    chunk-1 #br#0: Non-privilege access
                                                                                    is enabled #br#1: privilege access is
                                                                                    enabled */
/* GSC_SPC_PRIVATTRIB3[C1B0_4KB] Bits */
#define GSC_SPC_PRIVATTRIB3_C1B0_4KB_OFS         (12)                            /* !< C1B0_4KB Offset */
#define GSC_SPC_PRIVATTRIB3_C1B0_4KB_MASK        ((uint32_t)0x00001000U)         /* !< privilege access enabled to 1st 4KB
                                                                                    in chunk-1 #br#0: Non-privilege
                                                                                    access is enabled #br#1: privilege
                                                                                    access is enabled */
/* GSC_SPC_PRIVATTRIB3[C1B1_4KB] Bits */
#define GSC_SPC_PRIVATTRIB3_C1B1_4KB_OFS         (13)                            /* !< C1B1_4KB Offset */
#define GSC_SPC_PRIVATTRIB3_C1B1_4KB_MASK        ((uint32_t)0x00002000U)         /* !< privilege access enabled to 2nd 4KB
                                                                                    in chunk-1 #br#0: Non-privilege
                                                                                    access is enabled #br#1: privilege
                                                                                    access is enabled */
/* GSC_SPC_PRIVATTRIB3[C1B2_4KB] Bits */
#define GSC_SPC_PRIVATTRIB3_C1B2_4KB_OFS         (14)                            /* !< C1B2_4KB Offset */
#define GSC_SPC_PRIVATTRIB3_C1B2_4KB_MASK        ((uint32_t)0x00004000U)         /* !< privilege access enabled to 3rd 4KB
                                                                                    in chunk-1 #br#0: Non-privilege
                                                                                    access is enabled #br#1: privilege
                                                                                    access is enabled */
/* GSC_SPC_PRIVATTRIB3[C2B0_512B] Bits */
#define GSC_SPC_PRIVATTRIB3_C2B0_512B_OFS        (16)                            /* !< C2B0_512B Offset */
#define GSC_SPC_PRIVATTRIB3_C2B0_512B_MASK       ((uint32_t)0x00010000U)         /* !< privilege access enabled to 1st 512
                                                                                    byte in chunk-2 #br#0: Non-privilege
                                                                                    access is enabled #br#1: privilege
                                                                                    access is enabled */
/* GSC_SPC_PRIVATTRIB3[C2B1_512B] Bits */
#define GSC_SPC_PRIVATTRIB3_C2B1_512B_OFS        (17)                            /* !< C2B1_512B Offset */
#define GSC_SPC_PRIVATTRIB3_C2B1_512B_MASK       ((uint32_t)0x00020000U)         /* !< privilege access enabled to 2nd 512
                                                                                    byte in chunk-2 #br#0: Non-privilege
                                                                                    access is enabled #br#1: privilege
                                                                                    access is enabled */
/* GSC_SPC_PRIVATTRIB3[C2B0_1KB] Bits */
#define GSC_SPC_PRIVATTRIB3_C2B0_1KB_OFS         (18)                            /* !< C2B0_1KB Offset */
#define GSC_SPC_PRIVATTRIB3_C2B0_1KB_MASK        ((uint32_t)0x00040000U)         /* !< privilege access enabled to 1KB in
                                                                                    chunk-2 #br#0: Non-privilege access
                                                                                    is enabled #br#1: privilege access is
                                                                                    enabled */
/* GSC_SPC_PRIVATTRIB3[C2B0_2KB] Bits */
#define GSC_SPC_PRIVATTRIB3_C2B0_2KB_OFS         (19)                            /* !< C2B0_2KB Offset */
#define GSC_SPC_PRIVATTRIB3_C2B0_2KB_MASK        ((uint32_t)0x00080000U)         /* !< privilege access enabled to 2KB in
                                                                                    chunk-2 #br#0: Non-privilege access
                                                                                    is enabled #br#1: privilege access is
                                                                                    enabled */
/* GSC_SPC_PRIVATTRIB3[C2B0_4KB] Bits */
#define GSC_SPC_PRIVATTRIB3_C2B0_4KB_OFS         (20)                            /* !< C2B0_4KB Offset */
#define GSC_SPC_PRIVATTRIB3_C2B0_4KB_MASK        ((uint32_t)0x00100000U)         /* !< privilege access enabled to 1st 4KB
                                                                                    in chunk-2 #br#0: Non-privilege
                                                                                    access is enabled #br#1: privilege
                                                                                    access is enabled */
/* GSC_SPC_PRIVATTRIB3[C2B1_4KB] Bits */
#define GSC_SPC_PRIVATTRIB3_C2B1_4KB_OFS         (21)                            /* !< C2B1_4KB Offset */
#define GSC_SPC_PRIVATTRIB3_C2B1_4KB_MASK        ((uint32_t)0x00200000U)         /* !< privilege access enabled to 2nd 4KB
                                                                                    in chunk-2 #br#0: Non-privilege
                                                                                    access is enabled #br#1: privilege
                                                                                    access is enabled */
/* GSC_SPC_PRIVATTRIB3[C2B2_4KB] Bits */
#define GSC_SPC_PRIVATTRIB3_C2B2_4KB_OFS         (22)                            /* !< C2B2_4KB Offset */
#define GSC_SPC_PRIVATTRIB3_C2B2_4KB_MASK        ((uint32_t)0x00400000U)         /* !< privilege access enabled to 3rd 4KB
                                                                                    in chunk-2 #br#0: Non-privilege
                                                                                    access is enabled #br#1: privilege
                                                                                    access is enabled */
/* GSC_SPC_PRIVATTRIB3[C3B0_512B] Bits */
#define GSC_SPC_PRIVATTRIB3_C3B0_512B_OFS        (24)                            /* !< C3B0_512B Offset */
#define GSC_SPC_PRIVATTRIB3_C3B0_512B_MASK       ((uint32_t)0x01000000U)         /* !< privilege access enabled to 1st 512
                                                                                    byte in chunk-3 #br#0: Non-privilege
                                                                                    access is enabled #br#1: privilege
                                                                                    access is enabled */
/* GSC_SPC_PRIVATTRIB3[C3B1_512B] Bits */
#define GSC_SPC_PRIVATTRIB3_C3B1_512B_OFS        (25)                            /* !< C3B1_512B Offset */
#define GSC_SPC_PRIVATTRIB3_C3B1_512B_MASK       ((uint32_t)0x02000000U)         /* !< privilege access enabled to 2nd 512
                                                                                    byte in chunk-3 #br#0: Non-privilege
                                                                                    access is enabled #br#1: privilege
                                                                                    access is enabled */
/* GSC_SPC_PRIVATTRIB3[C3B0_1KB] Bits */
#define GSC_SPC_PRIVATTRIB3_C3B0_1KB_OFS         (26)                            /* !< C3B0_1KB Offset */
#define GSC_SPC_PRIVATTRIB3_C3B0_1KB_MASK        ((uint32_t)0x04000000U)         /* !< privilege access enabled to 1KB in
                                                                                    chunk-3 #br#0: Non-privilege access
                                                                                    is enabled #br#1: privilege access is
                                                                                    enabled */
/* GSC_SPC_PRIVATTRIB3[C3B0_2KB] Bits */
#define GSC_SPC_PRIVATTRIB3_C3B0_2KB_OFS         (27)                            /* !< C3B0_2KB Offset */
#define GSC_SPC_PRIVATTRIB3_C3B0_2KB_MASK        ((uint32_t)0x08000000U)         /* !< privilege access enabled to 2KB in
                                                                                    chunk-3 #br#0: Non-privilege access
                                                                                    is enabled #br#1: privilege access is
                                                                                    enabled */
/* GSC_SPC_PRIVATTRIB3[C3B0_4KB] Bits */
#define GSC_SPC_PRIVATTRIB3_C3B0_4KB_OFS         (28)                            /* !< C3B0_4KB Offset */
#define GSC_SPC_PRIVATTRIB3_C3B0_4KB_MASK        ((uint32_t)0x10000000U)         /* !< privilege access enabled to 1st 4KB
                                                                                    in chunk-3 #br#0: Non-privilege
                                                                                    access is enabled #br#1: privilege
                                                                                    access is enabled */
/* GSC_SPC_PRIVATTRIB3[C3B1_4KB] Bits */
#define GSC_SPC_PRIVATTRIB3_C3B1_4KB_OFS         (29)                            /* !< C3B1_4KB Offset */
#define GSC_SPC_PRIVATTRIB3_C3B1_4KB_MASK        ((uint32_t)0x20000000U)         /* !< privilege access enabled to 2nd 4KB
                                                                                    in chunk-3 #br#0: Non-privilege
                                                                                    access is enabled #br#1: privilege
                                                                                    access is enabled */
/* GSC_SPC_PRIVATTRIB3[C3B2_4KB] Bits */
#define GSC_SPC_PRIVATTRIB3_C3B2_4KB_OFS         (30)                            /* !< C3B2_4KB Offset */
#define GSC_SPC_PRIVATTRIB3_C3B2_4KB_MASK        ((uint32_t)0x40000000U)         /* !< privilege access enabled to 3rd 4KB
                                                                                    in chunk-3 #br#0: Non-privilege
                                                                                    access is enabled #br#1: privilege
                                                                                    access is enabled */

/* GSC_FPC_SECATTRIBA0 Bits */
/* GSC_FPC_SECATTRIBA0[SEC_PAGE] Bits */
#define GSC_FPC_SECATTRIBA0_SEC_PAGE_OFS         (0)                             /* !< SEC_PAGE Offset */
#define GSC_FPC_SECATTRIBA0_SEC_PAGE_MASK        ((uint32_t)0xFFFFFFFFU)         /* !< Secure access enable for first 32
                                                                                    sectors of flash with each bit
                                                                                    representing 1 sector of 2KB #br#0:
                                                                                    Non-secure access is enabled #br#1:
                                                                                    Secure access is enabled */

