TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gsc.h
/* GSC_FPC_SECATTRIBA1 Bits */
/* GSC_FPC_SECATTRIBA1[SEC_PAGE] Bits */
#define GSC_FPC_SECATTRIBA1_SEC_PAGE_OFS         (0)                             /* !< SEC_PAGE Offset */
#define GSC_FPC_SECATTRIBA1_SEC_PAGE_MASK        ((uint32_t)0xFFFFFFFFU)         /* !< Secure access enable for first 32
                                                                                    sectors of flash with each bit
                                                                                    representing 1 sector of 2KB #br#0:
                                                                                    Non-secure access is enabled #br#1:
                                                                                    Secure access is enabled */

/* GSC_FPC_SECATTRIBB0 Bits */
/* GSC_FPC_SECATTRIBB0[SEC_PAGE] Bits */
#define GSC_FPC_SECATTRIBB0_SEC_PAGE_OFS         (4)                             /* !< SEC_PAGE Offset */
#define GSC_FPC_SECATTRIBB0_SEC_PAGE_MASK        ((uint32_t)0xFFFFFFF0U)         /* !< Secure access enable for 64KB-512KB
                                                                                    flash with each bit representing 8
                                                                                    sectors of 2KB #br#0: Non-secure
                                                                                    access is enabled #br#1: Secure
                                                                                    access is enabled */

/* GSC_FPC_SECATTRIBB1 Bits */
/* GSC_FPC_SECATTRIBB1[SEC_PAGE] Bits */
#define GSC_FPC_SECATTRIBB1_SEC_PAGE_OFS         (4)                             /* !< SEC_PAGE Offset */
#define GSC_FPC_SECATTRIBB1_SEC_PAGE_MASK        ((uint32_t)0xFFFFFFF0U)         /* !< Secure access enable for 64KB-512KB
                                                                                    flash with each bit representing 8
                                                                                    sectors of 2KB #br#0: Non-secure
                                                                                    access is enabled #br#1: Secure
                                                                                    access is enabled */

/* GSC_FPC_NONMAIN_SECATTRIB0 Bits */
/* GSC_FPC_NONMAIN_SECATTRIB0[SEC_PAGE] Bits */
#define GSC_FPC_NONMAIN_SECATTRIB0_SEC_PAGE_OFS  (0)                             /* !< SEC_PAGE Offset */
#define GSC_FPC_NONMAIN_SECATTRIB0_SEC_PAGE_MASK ((uint32_t)0x0000000FU)         /* !< Secure access enable for first 4
                                                                                    sectors of flash with each bit
                                                                                    representing 1 sector of 2KB #br#0:
                                                                                    Non-secure access is enabled #br#1:
                                                                                    Secure access is enabled */

/* GSC_FPC_NONMAIN_SECATTRIB1 Bits */
/* GSC_FPC_NONMAIN_SECATTRIB1[SEC_PAGE] Bits */
#define GSC_FPC_NONMAIN_SECATTRIB1_SEC_PAGE_OFS  (0)                             /* !< SEC_PAGE Offset */
#define GSC_FPC_NONMAIN_SECATTRIB1_SEC_PAGE_MASK ((uint32_t)0x0000000FU)         /* !< Secure access enable for first 4
                                                                                    sectors of flash with each bit
                                                                                    representing 1 sector of 2KB #br#0:
                                                                                    Non-secure access is enabled #br#1:
                                                                                    Secure access is enabled */

/* GSC_FPC_TRIM_SECATTRIB0 Bits */
/* GSC_FPC_TRIM_SECATTRIB0[SEC_PAGE] Bits */
#define GSC_FPC_TRIM_SECATTRIB0_SEC_PAGE_OFS     (0)                             /* !< SEC_PAGE Offset */
#define GSC_FPC_TRIM_SECATTRIB0_SEC_PAGE_MASK    ((uint32_t)0x00000001U)         /* !< Secure access enable for the flash
                                                                                    with each bit representing 1 sector
                                                                                    of 2KB #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */

/* GSC_FPC_TRIM_SECATTRIB1 Bits */
/* GSC_FPC_TRIM_SECATTRIB1[SEC_PAGE] Bits */
#define GSC_FPC_TRIM_SECATTRIB1_SEC_PAGE_OFS     (0)                             /* !< SEC_PAGE Offset */
#define GSC_FPC_TRIM_SECATTRIB1_SEC_PAGE_MASK    ((uint32_t)0x00000001U)         /* !< Secure access enable for the flash
                                                                                    with each bit representing 1 sector
                                                                                    of 2KB #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */

/* GSC_FPC_ENGR_SECATTRIB0 Bits */
/* GSC_FPC_ENGR_SECATTRIB0[SEC_PAGE] Bits */
#define GSC_FPC_ENGR_SECATTRIB0_SEC_PAGE_OFS     (0)                             /* !< SEC_PAGE Offset */
#define GSC_FPC_ENGR_SECATTRIB0_SEC_PAGE_MASK    ((uint32_t)0x00000001U)         /* !< Secure access enable for the flash
                                                                                    with each bit representing 1 sector
                                                                                    of 2KB #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */

/* GSC_FPC_ENGR_SECATTRIB1 Bits */
/* GSC_FPC_ENGR_SECATTRIB1[SEC_PAGE] Bits */
#define GSC_FPC_ENGR_SECATTRIB1_SEC_PAGE_OFS     (0)                             /* !< SEC_PAGE Offset */
#define GSC_FPC_ENGR_SECATTRIB1_SEC_PAGE_MASK    ((uint32_t)0x00000001U)         /* !< Secure access enable for the flash
                                                                                    with each bit representing 1 sector
                                                                                    of 2KB #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */

