TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gsc.h
/* GSC_FPC_SECATTRIBA_DFLASH Bits */
/* GSC_FPC_SECATTRIBA_DFLASH[SEC_PAGE_DFLASH] Bits */
#define GSC_FPC_SECATTRIBA_DFLASH_SEC_PAGE_DFLASH_OFS (0)                             /* !< SEC_PAGE_DFLASH Offset */
#define GSC_FPC_SECATTRIBA_DFLASH_SEC_PAGE_DFLASH_MASK ((uint32_t)0x0000FFFFU)         /* !< Secure access enable for first 16
                                                                                    sectors data flash page with each bit
                                                                                    representing 1 sector of 2KB #br#0:
                                                                                    Non-secure access is enabled #br#1:
                                                                                    Secure access is enabled */

/* GSC_FPC_ENGR_SECATTRIB_DFLASH Bits */
/* GSC_FPC_ENGR_SECATTRIB_DFLASH[SEC_PAGE_DFLASH] Bits */
#define GSC_FPC_ENGR_SECATTRIB_DFLASH_SEC_PAGE_DFLASH_OFS (0)                             /* !< SEC_PAGE_DFLASH Offset */
#define GSC_FPC_ENGR_SECATTRIB_DFLASH_SEC_PAGE_DFLASH_MASK ((uint32_t)0x00000001U)         /* !< Secure access enable for 1 sector
                                                                                    of 2KB  #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */

/* GSC_FPC_NONMAIN_SECATTRIB_DFLASH Bits */
/* GSC_FPC_NONMAIN_SECATTRIB_DFLASH[SEC_PAGE_DFLASH] Bits */
#define GSC_FPC_NONMAIN_SECATTRIB_DFLASH_SEC_PAGE_DFLASH_OFS (0)                             /* !< SEC_PAGE_DFLASH Offset */
#define GSC_FPC_NONMAIN_SECATTRIB_DFLASH_SEC_PAGE_DFLASH_MASK ((uint32_t)0x0000000FU)         /* !< Secure access enable for 4 sector
                                                                                    with each bit representing 1 sector
                                                                                    of 2KB #br#0: Non-secure access is
                                                                                    enabled #br#1: Secure access is
                                                                                    enabled */

/* GSC_FPC_PRIVATTRIBA0 Bits */
/* GSC_FPC_PRIVATTRIBA0[PRIV_PAGE] Bits */
#define GSC_FPC_PRIVATTRIBA0_PRIV_PAGE_OFS       (0)                             /* !< PRIV_PAGE Offset */
#define GSC_FPC_PRIVATTRIBA0_PRIV_PAGE_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< Privilege access enable for first
                                                                                    32 sectors of flash with each bit
                                                                                    representing 1 sector of 2KB #br#0:
                                                                                    Non-Privilege access is enabled
                                                                                    #br#1: Privilege access is enabled */

/* GSC_FPC_PRIVATTRIBA1 Bits */
/* GSC_FPC_PRIVATTRIBA1[PRIV_PAGE] Bits */
#define GSC_FPC_PRIVATTRIBA1_PRIV_PAGE_OFS       (0)                             /* !< PRIV_PAGE Offset */
#define GSC_FPC_PRIVATTRIBA1_PRIV_PAGE_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< Privilege access enable for first
                                                                                    32 sectors of flash with each bit
                                                                                    representing 1 sector of 2KB #br#0:
                                                                                    Non-Privilege access is enabled
                                                                                    #br#1: Privilege access is enabled */

/* GSC_FPC_PRIVATTRIBB0 Bits */
/* GSC_FPC_PRIVATTRIBB0[PRIV_PAGE] Bits */
#define GSC_FPC_PRIVATTRIBB0_PRIV_PAGE_OFS       (4)                             /* !< PRIV_PAGE Offset */
#define GSC_FPC_PRIVATTRIBB0_PRIV_PAGE_MASK      ((uint32_t)0xFFFFFFF0U)         /* !< Privilege access enable for
                                                                                    64KB-512KB flash with each bit
                                                                                    representing 8 sectors of 2KB #br#0:
                                                                                    Non-privilege access is enabled
                                                                                    #br#1: privilege access is enabled */

/* GSC_FPC_PRIVATTRIBB1 Bits */
/* GSC_FPC_PRIVATTRIBB1[PRIV_PAGE] Bits */
#define GSC_FPC_PRIVATTRIBB1_PRIV_PAGE_OFS       (4)                             /* !< PRIV_PAGE Offset */
#define GSC_FPC_PRIVATTRIBB1_PRIV_PAGE_MASK      ((uint32_t)0xFFFFFFF0U)         /* !< Privilege access enable for
                                                                                    64KB-512KB flash with each bit
                                                                                    representing 8 sectors of 2KB #br#0:
                                                                                    Non-privilege access is enabled
                                                                                    #br#1: privilege access is enabled */

/* GSC_FPC_NONMAIN_PRIVATTRIB0 Bits */
/* GSC_FPC_NONMAIN_PRIVATTRIB0[PRIV_PAGE] Bits */
#define GSC_FPC_NONMAIN_PRIVATTRIB0_PRIV_PAGE_OFS (0)                             /* !< PRIV_PAGE Offset */
#define GSC_FPC_NONMAIN_PRIVATTRIB0_PRIV_PAGE_MASK ((uint32_t)0x0000000FU)         /* !< Privilege access enable for first 4
                                                                                    sectors of flash with each bit
                                                                                    representing 1 sector of 2KB #br#0:
                                                                                    Non-Privilege access is enabled
                                                                                    #br#1: Privilege access is enabled */

