TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gsc.h
/* GSC_FPC_NONMAIN_PRIVATTRIB1 Bits */
/* GSC_FPC_NONMAIN_PRIVATTRIB1[PRIV_PAGE] Bits */
#define GSC_FPC_NONMAIN_PRIVATTRIB1_PRIV_PAGE_OFS (0)                             /* !< PRIV_PAGE Offset */
#define GSC_FPC_NONMAIN_PRIVATTRIB1_PRIV_PAGE_MASK ((uint32_t)0x0000000FU)         /* !< Privilege access enable for first 4
                                                                                    sectors of flash with each bit
                                                                                    representing 1 sector of 2KB #br#0:
                                                                                    Non-Privilege access is enabled
                                                                                    #br#1: Privilege access is enabled */

/* GSC_FPC_TRIM_PRIVATTRIB0 Bits */
/* GSC_FPC_TRIM_PRIVATTRIB0[PRIV_PAGE] Bits */
#define GSC_FPC_TRIM_PRIVATTRIB0_PRIV_PAGE_OFS   (0)                             /* !< PRIV_PAGE Offset */
#define GSC_FPC_TRIM_PRIVATTRIB0_PRIV_PAGE_MASK  ((uint32_t)0x00000001U)         /* !< Privilege access enable for the
                                                                                    flash with each bit representing 1
                                                                                    sector of 2KB #br#0: Non-Privilege
                                                                                    access is enabled #br#1: Privilege
                                                                                    access is enabled */

/* GSC_FPC_TRIM_PRIVATTRIB1 Bits */
/* GSC_FPC_TRIM_PRIVATTRIB1[PRIV_PAGE] Bits */
#define GSC_FPC_TRIM_PRIVATTRIB1_PRIV_PAGE_OFS   (0)                             /* !< PRIV_PAGE Offset */
#define GSC_FPC_TRIM_PRIVATTRIB1_PRIV_PAGE_MASK  ((uint32_t)0x00000001U)         /* !< Privilege access enable for the
                                                                                    flash with each bit representing 1
                                                                                    sector of 2KB #br#0: Non-Privilege
                                                                                    access is enabled #br#1: Privilege
                                                                                    access is enabled */

/* GSC_FPC_ENGR_PRIVATTRIB0 Bits */
/* GSC_FPC_ENGR_PRIVATTRIB0[PRIV_PAGE] Bits */
#define GSC_FPC_ENGR_PRIVATTRIB0_PRIV_PAGE_OFS   (0)                             /* !< PRIV_PAGE Offset */
#define GSC_FPC_ENGR_PRIVATTRIB0_PRIV_PAGE_MASK  ((uint32_t)0x00000001U)         /* !< Privilege access enable for the
                                                                                    flash with each bit representing 1
                                                                                    sector of 2KB #br#0: Non-Privilege
                                                                                    access is enabled #br#1: Privilege
                                                                                    access is enabled */

/* GSC_FPC_ENGR_PRIVATTRIB1 Bits */
/* GSC_FPC_ENGR_PRIVATTRIB1[PRIV_PAGE] Bits */
#define GSC_FPC_ENGR_PRIVATTRIB1_PRIV_PAGE_OFS   (0)                             /* !< PRIV_PAGE Offset */
#define GSC_FPC_ENGR_PRIVATTRIB1_PRIV_PAGE_MASK  ((uint32_t)0x00000001U)         /* !< Privilege access enable for the
                                                                                    flash with each bit representing 1
                                                                                    sector of 2KB #br#0: Non-Privilege
                                                                                    access is enabled #br#1: Privilege
                                                                                    access is enabled */

/* GSC_FPC_PRIVATTRIBA_DFLASH Bits */
/* GSC_FPC_PRIVATTRIBA_DFLASH[PRIV_PAGE_DFLASH] Bits */
#define GSC_FPC_PRIVATTRIBA_DFLASH_PRIV_PAGE_DFLASH_OFS (0)                             /* !< PRIV_PAGE_DFLASH Offset */
#define GSC_FPC_PRIVATTRIBA_DFLASH_PRIV_PAGE_DFLASH_MASK ((uint32_t)0x0000FFFFU)         /* !< Privilege access enable for first
                                                                                    16 sectors data flash page with each
                                                                                    bit representing 1 sector of 2KB
                                                                                    #br#0: Non-Privilege access is
                                                                                    enabled #br#1: Privilege access is
                                                                                    enabled */

/* GSC_FPC_NONMAIN_PRIVATTRIB_DFLASH Bits */
/* GSC_FPC_NONMAIN_PRIVATTRIB_DFLASH[PRIV_PAGE_DFLASH] Bits */
#define GSC_FPC_NONMAIN_PRIVATTRIB_DFLASH_PRIV_PAGE_DFLASH_OFS (0)                             /* !< PRIV_PAGE_DFLASH Offset */
#define GSC_FPC_NONMAIN_PRIVATTRIB_DFLASH_PRIV_PAGE_DFLASH_MASK ((uint32_t)0x0000000FU)         /* !< Privilege access enable for 4
                                                                                    sectors each of 2KB #br#0:
                                                                                    Non-Privilege access is enabled
                                                                                    #br#1: Privilege access is enabled */

/* GSC_FPC_ENGR_PRIVATTRIB_DFLASH Bits */
/* GSC_FPC_ENGR_PRIVATTRIB_DFLASH[PRIV_PAGE_DFLASH] Bits */
#define GSC_FPC_ENGR_PRIVATTRIB_DFLASH_PRIV_PAGE_DFLASH_OFS (0)                             /* !< PRIV_PAGE_DFLASH Offset */
#define GSC_FPC_ENGR_PRIVATTRIB_DFLASH_PRIV_PAGE_DFLASH_MASK ((uint32_t)0x00000001U)         /* !< Privilege access enable for 1
                                                                                    sector of 2KB #br#0: Non-Privilege
                                                                                    access is enabled #br#1: Privilege
                                                                                    access is enabled */

