TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gsc.h
/* GSC_FPC_WEPROTA0 Bits */
/* GSC_FPC_WEPROTA0[WEPROT_PAGE] Bits */
#define GSC_FPC_WEPROTA0_WEPROT_PAGE_OFS         (0)                             /* !< WEPROT_PAGE Offset */
#define GSC_FPC_WEPROTA0_WEPROT_PAGE_MASK        ((uint32_t)0xFFFFFFFFU)         /* !< Write protection enable for first
                                                                                    32 sectors of flash with each bit
                                                                                    representing 1 sector of 2KB #br#0:
                                                                                    Page is not erase/program protected
                                                                                    #br#1: Page is erase/program
                                                                                    protected */

/* GSC_FPC_WEPROTA1 Bits */
/* GSC_FPC_WEPROTA1[WEPROT_PAGE] Bits */
#define GSC_FPC_WEPROTA1_WEPROT_PAGE_OFS         (0)                             /* !< WEPROT_PAGE Offset */
#define GSC_FPC_WEPROTA1_WEPROT_PAGE_MASK        ((uint32_t)0xFFFFFFFFU)         /* !< Write protection enable for first
                                                                                    32 sectors of flash with each bit
                                                                                    representing 1 sector of 2KB #br#0:
                                                                                    Page is not erase/program protected
                                                                                    #br#1: Page is erase/program
                                                                                    protected */

/* GSC_FPC_WEPROTB0 Bits */
/* GSC_FPC_WEPROTB0[WEPROT_PAGE] Bits */
#define GSC_FPC_WEPROTB0_WEPROT_PAGE_OFS         (0)                             /* !< WEPROT_PAGE Offset */
#define GSC_FPC_WEPROTB0_WEPROT_PAGE_MASK        ((uint32_t)0xFFFFFFFFU)         /* !< Write Protection enable for
                                                                                    512KB-1024KB flash with each bit
                                                                                    representing 8 sectors of 2KB #br#0:
                                                                                    Page is not erase/program protected
                                                                                    #br#1: Page is erase/program
                                                                                    protected */

/* GSC_FPC_WEPROTB1 Bits */
/* GSC_FPC_WEPROTB1[WEPROT_PAGE] Bits */
#define GSC_FPC_WEPROTB1_WEPROT_PAGE_OFS         (0)                             /* !< WEPROT_PAGE Offset */
#define GSC_FPC_WEPROTB1_WEPROT_PAGE_MASK        ((uint32_t)0xFFFFFFFFU)         /* !< Write Protection enable for
                                                                                    512KB-1024KB flash with each bit
                                                                                    representing 8 sectors of 2KB #br#0:
                                                                                    Page is not erase/program protected
                                                                                    #br#1: Page is erase/program
                                                                                    protected */

/* GSC_FPC_WEPROTNONMAIN0 Bits */
/* GSC_FPC_WEPROTNONMAIN0[WEPROT_PAGE] Bits */
#define GSC_FPC_WEPROTNONMAIN0_WEPROT_PAGE_OFS   (0)                             /* !< WEPROT_PAGE Offset */
#define GSC_FPC_WEPROTNONMAIN0_WEPROT_PAGE_MASK  ((uint32_t)0x0000000FU)         /* !< Write protection enable for first 4
                                                                                    sectors of flash with each bit
                                                                                    representing 1 sector of 2KB #br#0:
                                                                                    Page is not erase/program protected
                                                                                    #br#1: Page is erase/program
                                                                                    protected */

/* GSC_FPC_WEPROTNONMAIN1 Bits */
/* GSC_FPC_WEPROTNONMAIN1[WEPROT_PAGE] Bits */
#define GSC_FPC_WEPROTNONMAIN1_WEPROT_PAGE_OFS   (0)                             /* !< WEPROT_PAGE Offset */
#define GSC_FPC_WEPROTNONMAIN1_WEPROT_PAGE_MASK  ((uint32_t)0x0000000FU)         /* !< Write protection enable for first 4
                                                                                    sectors of flash with each bit
                                                                                    representing 1 sector of 2KB #br#0:
                                                                                    Page is not erase/program protected
                                                                                    #br#1: Page is erase/program
                                                                                    protected */

/* GSC_FPC_WEPROTTRIM0 Bits */
/* GSC_FPC_WEPROTTRIM0[WEPROT_PAGE] Bits */
#define GSC_FPC_WEPROTTRIM0_WEPROT_PAGE_OFS      (0)                             /* !< WEPROT_PAGE Offset */
#define GSC_FPC_WEPROTTRIM0_WEPROT_PAGE_MASK     ((uint32_t)0x00000003U)         /* !< Write protection enable for first 2
                                                                                    sectors of flash with each bit
                                                                                    representing 1 sector of 2KB #br#0:
                                                                                    Page is not erase/program protected
                                                                                    #br#1: Page is erase/program
                                                                                    protected */

/* GSC_FPC_WEPROTTRIM1 Bits */
/* GSC_FPC_WEPROTTRIM1[WEPROT_PAGE] Bits */
#define GSC_FPC_WEPROTTRIM1_WEPROT_PAGE_OFS      (0)                             /* !< WEPROT_PAGE Offset */
#define GSC_FPC_WEPROTTRIM1_WEPROT_PAGE_MASK     ((uint32_t)0x00000003U)         /* !< Write protection enable for first 2
                                                                                    sectors of flash with each bit
                                                                                    representing 1 sector of 2KB #br#0:
                                                                                    Page is not erase/program protected
                                                                                    #br#1: Page is erase/program
                                                                                    protected */

/* GSC_FPC_WEPROTENGR0 Bits */
/* GSC_FPC_WEPROTENGR0[WEPROT_PAGE] Bits */
#define GSC_FPC_WEPROTENGR0_WEPROT_PAGE_OFS      (0)                             /* !< WEPROT_PAGE Offset */
#define GSC_FPC_WEPROTENGR0_WEPROT_PAGE_MASK     ((uint32_t)0x00000003U)         /* !< Write protection enable for first 2
                                                                                    sectors of flash with each bit
                                                                                    representing 1 sector of 2KB #br#0:
                                                                                    Page is not erase/program protected
                                                                                    #br#1: Page is erase/program
                                                                                    protected */

/* GSC_FPC_WEPROTENGR1 Bits */
/* GSC_FPC_WEPROTENGR1[WEPROT_PAGE] Bits */
#define GSC_FPC_WEPROTENGR1_WEPROT_PAGE_OFS      (0)                             /* !< WEPROT_PAGE Offset */
#define GSC_FPC_WEPROTENGR1_WEPROT_PAGE_MASK     ((uint32_t)0x00000003U)         /* !< Write protection enable for first 2
                                                                                    sectors of flash with each bit
                                                                                    representing 1 sector of 2KB #br#0:
                                                                                    Page is not erase/program protected
                                                                                    #br#1: Page is erase/program
                                                                                    protected */

