TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gsc.h
/* GSC_FPC_WEPROTA_DFLASH Bits */
/* GSC_FPC_WEPROTA_DFLASH[WEPROT_PAGE_DFLASH] Bits */
#define GSC_FPC_WEPROTA_DFLASH_WEPROT_PAGE_DFLASH_OFS (0)                             /* !< WEPROT_PAGE_DFLASH Offset */
#define GSC_FPC_WEPROTA_DFLASH_WEPROT_PAGE_DFLASH_MASK ((uint32_t)0x0000FFFFU)         /* !< Write protection enable for first
                                                                                    16 sectors data flash page with each
                                                                                    bit representing 1 sector of 2KB
                                                                                    #br#0: Page is not erase/program
                                                                                    protected #br#1: Page is
                                                                                    erase/program protected */
/* GSC_FPC_WEPROTA_DFLASH[WEPROT_PAGE_DFLASH] Bits */

/* GSC_FPC_WEPROT_NONMAIN_DFLASH Bits */
/* GSC_FPC_WEPROT_NONMAIN_DFLASH[WEPROT_PAGE_DFLASH] Bits */
#define GSC_FPC_WEPROT_NONMAIN_DFLASH_WEPROT_PAGE_DFLASH_OFS (0)                             /* !< WEPROT_PAGE_DFLASH Offset */
#define GSC_FPC_WEPROT_NONMAIN_DFLASH_WEPROT_PAGE_DFLASH_MASK ((uint32_t)0x0000000FU)         /* !< Write protection enable for NONMAIN
                                                                                    sectors data flash page with each bit
                                                                                    representing 1 sector of 2KB #br#0:
                                                                                    Page is not erase/program protected
                                                                                    #br#1: Page is erase/program
                                                                                    protected */

/* GSC_FPC_WEPROT_ENGR_DFLASH Bits */
/* GSC_FPC_WEPROT_ENGR_DFLASH[WEPROT_PAGE_DFLASH] Bits */
#define GSC_FPC_WEPROT_ENGR_DFLASH_WEPROT_PAGE_DFLASH_OFS (0)                             /* !< WEPROT_PAGE_DFLASH Offset */
#define GSC_FPC_WEPROT_ENGR_DFLASH_WEPROT_PAGE_DFLASH_MASK ((uint32_t)0x00000003U)         /* !< Write protection enable for ENGR
                                                                                    data flash page with each bit
                                                                                    representing 1 sector of 2KB #br#0:
                                                                                    Page is not erase/program protected
                                                                                    #br#1: Page is erase/program
                                                                                    protected */

/* GSC_FPC_FLSEMREQ Bits */
/* GSC_FPC_FLSEMREQ[REQ] Bits */
#define GSC_FPC_FLSEMREQ_REQ_OFS                 (0)                             /* !< REQ Offset */
#define GSC_FPC_FLSEMREQ_REQ_MASK                ((uint32_t)0x00000001U)         /* !< If the FLSEMSTAT.ASSIGNED bit is
                                                                                    cleared, writing a '1' to this bit
                                                                                    causes: #br#  1) Load the SECURE
                                                                                    attribute  of the code performing the
                                                                                    write into the FLSEMSTAT.SEC bit
                                                                                    field, and #br#  2) Load the
                                                                                    Privilage attribute of the code
                                                                                    performing the write into the
                                                                                    FLSEMSTAT.PRIV bit field, and #br# 3)
                                                                                    Set the FLSEMSTAT.ASSIGNED bit.
                                                                                    #br#If the FLSEMSTAT.ASSIGNED is
                                                                                    already set when a write to this bit
                                                                                    occurs, the write will be ignored.
                                                                                    #br# #br#If the above conditions are
                                                                                    not met during the write, the write
                                                                                    will be ignored with no error
                                                                                    indicator. It is advised that the
                                                                                    writing code perform a read of the
                                                                                    FLSEMSTAT register  to ensure it was
                                                                                    set after writing to this bit. */

/* GSC_FPC_FLSEMCLR Bits */
/* GSC_FPC_FLSEMCLR[CLR] Bits */
#define GSC_FPC_FLSEMCLR_CLR_OFS                 (0)                             /* !< CLR Offset */
#define GSC_FPC_FLSEMCLR_CLR_MASK                ((uint32_t)0x00000001U)         /* !< If the following conditions are
                                                                                    met, a write of '1' to this bit
                                                                                    causes the FLSEMSTAT register to its
                                                                                    reset state: #br#  1) The
                                                                                    FLSEMSTAT.SEC  of the code performing
                                                                                    the write is 0x1 and FLSEMSTAT.PRIV
                                                                                    of the code performing the write is
                                                                                    0x1 (i.e. secure privilage code can
                                                                                    force relinquishing of the semaphore)
                                                                                    or #br#  2) FLSEMSTAT.ASSIGNED bit is
                                                                                    set, and #br#      a) FLSEMSTAT.SEC
                                                                                    matches security attribute of the
                                                                                    code performing the write, and #br#
                                                                                    b) FLSEMSTAT.PRIV  matches
                                                                                    privilege attribute code performing
                                                                                    the write. #br# #br#If the above
                                                                                    conditions are not met during the
                                                                                    write, the write will be ignored with
                                                                                    no error indicated. It is advised
                                                                                    that the writing code perform a read
                                                                                    of the FLSEMSTAT register  to ensure
                                                                                    it was cleared after writing to this
                                                                                    bit. */

