TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gsc.h
/* GSC_FPC_FLSEMSTAT Bits */
/* GSC_FPC_FLSEMSTAT[SEC] Bits */
#define GSC_FPC_FLSEMSTAT_SEC_OFS                (0)                             /* !< SEC Offset */
#define GSC_FPC_FLSEMSTAT_SEC_MASK               ((uint32_t)0x00000001U)         /* !< Defines the flash controller
                                                                                    semaphore owners security attribute
                                                                                    #br#  0x0 : non-secure #br#  0x1
                                                                                    :secure */
/* GSC_FPC_FLSEMSTAT[PRIV] Bits */
#define GSC_FPC_FLSEMSTAT_PRIV_OFS               (8)                             /* !< PRIV Offset */
#define GSC_FPC_FLSEMSTAT_PRIV_MASK              ((uint32_t)0x00000100U)         /* !< Defines the flash controller
                                                                                    semaphore owners privilage attribute
                                                                                    #br#  0x0 : non-privilage #br#  0x1
                                                                                    :prvilage */
/* GSC_FPC_FLSEMSTAT[DBGACC] Bits */
#define GSC_FPC_FLSEMSTAT_DBGACC_OFS             (16)                            /* !< DBGACC Offset */
#define GSC_FPC_FLSEMSTAT_DBGACC_MASK            ((uint32_t)0x00010000U)         /* !< Defines the flash controller
                                                                                    semaphore owners debug access
                                                                                    indication #br#  0x0 : functional
                                                                                    access #br#  0x1 :Debug access */
/* GSC_FPC_FLSEMSTAT[MATCH] Bits */
#define GSC_FPC_FLSEMSTAT_MATCH_OFS              (30)                            /* !< MATCH Offset */
#define GSC_FPC_FLSEMSTAT_MATCH_MASK             ((uint32_t)0x40000000U)         /* !< On a read, this bit will reflect
                                                                                    whether the reader's SEC and PRIV
                                                                                    matches the ownership of the flash
                                                                                    controller. #br#  0 : Code performing
                                                                                    read does not own the flash
                                                                                    controller semaphore #br#  1 : Code
                                                                                    performing read owns the flash
                                                                                    controller semphore. #br#This avoids
                                                                                    code from being required to know
                                                                                    whether the current code segment owns
                                                                                    the flash  controller configuration. */
/* GSC_FPC_FLSEMSTAT[ASSIGNED] Bits */
#define GSC_FPC_FLSEMSTAT_ASSIGNED_OFS           (31)                            /* !< ASSIGNED Offset */
#define GSC_FPC_FLSEMSTAT_ASSIGNED_MASK          ((uint32_t)0x80000000U)         /* !< SEC  and PRIV fields are valid when
                                                                                    this bit is set. #br#  0 : SEC  and
                                                                                    PRIV are unassigned and flash
                                                                                    controller is not accessible #br#  1
                                                                                    : SEC and PRIV values are valid and
                                                                                    the flash controller is currently
                                                                                    assigned to them */

/* GSC_DMA_TRIG_SEL Bits */
/* GSC_DMA_TRIG_SEL[SEL_TRIG] Bits */
#define GSC_DMA_TRIG_SEL_SEL_TRIG_OFS            (0)                             /* !< SEL_TRIG Offset */
#define GSC_DMA_TRIG_SEL_SEL_TRIG_MASK           ((uint32_t)0x0FFFFFFFU)         /* !< Select signal for DMA triggers to
                                                                                    be routed to DMA0/DMA1 #br#0: DMA0
                                                                                    will be selected #br#1: DMA1 will be
                                                                                    selected #br#Note: SEL_TRIG[9:6] is
                                                                                    not used. #br#If a specific DMA is
                                                                                    selected, the triggers should only go
                                                                                    to that DMA */

/* GSC_DMA_FIX_TRIG_SEL Bits */
/* GSC_DMA_FIX_TRIG_SEL[SEL_TRIG] Bits */
#define GSC_DMA_FIX_TRIG_SEL_SEL_TRIG_OFS        (0)                             /* !< SEL_TRIG Offset */
#define GSC_DMA_FIX_TRIG_SEL_SEL_TRIG_MASK       ((uint32_t)0x000007FFU)         /* !< Select signal for Fixed DMA
                                                                                    triggers to be routed to DMA0/DMA1
                                                                                    #br#0: DMA0 will be selected #br#1:
                                                                                    DMA1 will be selected #br# #br#If a
                                                                                    specific DMA is selected, the
                                                                                    triggers should only go to that DMA */

