TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gsc.h
/* GSC_VTOR_S Bits */
/* GSC_VTOR_S[VTOR_S] Bits */
#define GSC_VTOR_S_VTOR_S_OFS                    (0)                             /* !< VTOR_S Offset */
#define GSC_VTOR_S_VTOR_S_MASK                   ((uint32_t)0xFFFFFFFFU)         /* !< value of INITSVTOR port at CPUSS
                                                                                    boundary */

/* GSC_VTOR_NS Bits */
/* GSC_VTOR_NS[VTOR_NS] Bits */
#define GSC_VTOR_NS_VTOR_NS_OFS                  (0)                             /* !< VTOR_NS Offset */
#define GSC_VTOR_NS_VTOR_NS_MASK                 ((uint32_t)0xFFFFFFFFU)         /* !< value of INITNSVTOR port at CPUSS
                                                                                    boundary */

/* GSC_DTB_MUXSEL Bits */
/* GSC_DTB_MUXSEL[DTB_MUX_SEL_CPU] Bits */
#define GSC_DTB_MUXSEL_DTB_MUX_SEL_CPU_OFS       (0)                             /* !< DTB_MUX_SEL_CPU Offset */
#define GSC_DTB_MUXSEL_DTB_MUX_SEL_CPU_MASK      ((uint32_t)0x00000007U)         /* !< DTB Mux Sel for CPU signals to be
                                                                                    brought out on DTB. Refer to
                                                                                    implementaion spec for mux selection
                                                                                    table. */
/* GSC_DTB_MUXSEL[DTB_MUX_SEL_WUC] Bits */
#define GSC_DTB_MUXSEL_DTB_MUX_SEL_WUC_OFS       (5)                             /* !< DTB_MUX_SEL_WUC Offset */
#define GSC_DTB_MUXSEL_DTB_MUX_SEL_WUC_MASK      ((uint32_t)0x000003E0U)         /* !< DTB Mux Sel for WUC signals to be
                                                                                    brought out on DTB. Refer to
                                                                                    implementaion spec for mux selection
                                                                                    table. */

/* GSC_DICE_CHECKSUM0 Bits */
/* GSC_DICE_CHECKSUM0[CID] Bits */
#define GSC_DICE_CHECKSUM0_CID_OFS               (0)                             /* !< CID Offset */
#define GSC_DICE_CHECKSUM0_CID_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< The register stores the 32-byte
                                                                                    DICE Composite Device Identifier
                                                                                    (CDI) value */

/* GSC_DICE_CHECKSUM1 Bits */
/* GSC_DICE_CHECKSUM1[CID] Bits */
#define GSC_DICE_CHECKSUM1_CID_OFS               (0)                             /* !< CID Offset */
#define GSC_DICE_CHECKSUM1_CID_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< The register stores the 32-byte
                                                                                    DICE Composite Device Identifier
                                                                                    (CDI) value */

/* GSC_DICE_CHECKSUM2 Bits */
/* GSC_DICE_CHECKSUM2[CID] Bits */
#define GSC_DICE_CHECKSUM2_CID_OFS               (0)                             /* !< CID Offset */
#define GSC_DICE_CHECKSUM2_CID_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< The register stores the 32-byte
                                                                                    DICE Composite Device Identifier
                                                                                    (CDI) value */

/* GSC_DICE_CHECKSUM3 Bits */
/* GSC_DICE_CHECKSUM3[CID] Bits */
#define GSC_DICE_CHECKSUM3_CID_OFS               (0)                             /* !< CID Offset */
#define GSC_DICE_CHECKSUM3_CID_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< The register stores the 32-byte
                                                                                    DICE Composite Device Identifier
                                                                                    (CDI) value */

/* GSC_DICE_CHECKSUM4 Bits */
/* GSC_DICE_CHECKSUM4[CID] Bits */
#define GSC_DICE_CHECKSUM4_CID_OFS               (0)                             /* !< CID Offset */
#define GSC_DICE_CHECKSUM4_CID_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< The register stores the 32-byte
                                                                                    DICE Composite Device Identifier
                                                                                    (CDI) value */

/* GSC_DICE_CHECKSUM5 Bits */
/* GSC_DICE_CHECKSUM5[CID] Bits */
#define GSC_DICE_CHECKSUM5_CID_OFS               (0)                             /* !< CID Offset */
#define GSC_DICE_CHECKSUM5_CID_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< The register stores the 32-byte
                                                                                    DICE Composite Device Identifier
                                                                                    (CDI) value */

/* GSC_DICE_CHECKSUM6 Bits */
/* GSC_DICE_CHECKSUM6[CID] Bits */
#define GSC_DICE_CHECKSUM6_CID_OFS               (0)                             /* !< CID Offset */
#define GSC_DICE_CHECKSUM6_CID_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< The register stores the 32-byte
                                                                                    DICE Composite Device Identifier
                                                                                    (CDI) value */

/* GSC_DICE_CHECKSUM7 Bits */
/* GSC_DICE_CHECKSUM7[CID] Bits */
#define GSC_DICE_CHECKSUM7_CID_OFS               (0)                             /* !< CID Offset */
#define GSC_DICE_CHECKSUM7_CID_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< The register stores the 32-byte
                                                                                    DICE Composite Device Identifier
                                                                                    (CDI) value */

