TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gsc.h
/* GSC_GSC_LOCK Bits */
/* GSC_GSC_LOCK[ATTRIBVIOL_CONFIG] Bits */
#define GSC_GSC_LOCK_ATTRIBVIOL_CONFIG_OFS       (0)                             /* !< ATTRIBVIOL_CONFIG Offset */
#define GSC_GSC_LOCK_ATTRIBVIOL_CONFIG_MASK      ((uint32_t)0x00000001U)         /* !< Configuration impacts registers
                                                                                    SPC_ATTRIBVIOLS_CONFIG,
                                                                                    SPC_ATTRIBVIOLP_CONFIG,
                                                                                    PPC_ATTRIBVIOLS_CONFIG,
                                                                                    PPC_ATTRIBVIOLP_CONFIG,
                                                                                    FPC_ATTRIBVIOLS_CONFIG,
                                                                                    FPC_ATTRIBVIOLP_CONFIG	 #br#0:
                                                                                    Register configuration is not locked.
                                                                                    #br#1: Register configuration is
                                                                                    locked. #br# #br#Once register is
                                                                                    locked - reads give the MMR data and
                                                                                    writes are ignored */
/* GSC_GSC_LOCK[PPC_AATRIB] Bits */
#define GSC_GSC_LOCK_PPC_AATRIB_OFS              (1)                             /* !< PPC_AATRIB Offset */
#define GSC_GSC_LOCK_PPC_AATRIB_MASK             ((uint32_t)0x00000002U)         /* !< Configuration impacts registers
                                                                                    PPC_SECATTRIB_* and PPC_PRIVATTRIB_*
                                                                                    #br#0: Register configuration is not
                                                                                    locked. #br#1: Register configuration
                                                                                    is locked. #br# #br#Once register is
                                                                                    locked - reads give the MMR data and
                                                                                    writes are ignored */
/* GSC_GSC_LOCK[SPC_AATRIB] Bits */
#define GSC_GSC_LOCK_SPC_AATRIB_OFS              (2)                             /* !< SPC_AATRIB Offset */
#define GSC_GSC_LOCK_SPC_AATRIB_MASK             ((uint32_t)0x00000004U)         /* !< Configuration impacts registers
                                                                                    SPC_SECATTRIB_* and SPC_PRIVATTRIB_*
                                                                                    #br#0: Register configuration is not
                                                                                    locked. #br#1: Register configuration
                                                                                    is locked. #br# #br#Once register is
                                                                                    locked - reads give the MMR data and
                                                                                    writes are ignored */
/* GSC_GSC_LOCK[FPPC_AATRIB] Bits */
#define GSC_GSC_LOCK_FPPC_AATRIB_OFS             (3)                             /* !< FPPC_AATRIB Offset */
#define GSC_GSC_LOCK_FPPC_AATRIB_MASK            ((uint32_t)0x00000008U)         /* !< Configuration impacts registers
                                                                                    FPC_SECATTRIB_* and FPC_PRIVATTRIB_*
                                                                                    #br#0: Register configuration is not
                                                                                    locked. #br#1: Register configuration
                                                                                    is locked. #br# #br#Once register is
                                                                                    locked - reads give the MMR data and
                                                                                    writes are ignored */
/* GSC_GSC_LOCK[VTOR] Bits */
#define GSC_GSC_LOCK_VTOR_OFS                    (5)                             /* !< VTOR Offset */
#define GSC_GSC_LOCK_VTOR_MASK                   ((uint32_t)0x00000020U)         /* !< Configuration impacts registers
                                                                                    VTOR_* #br#0: Register configuration
                                                                                    is not locked. #br#1: Register
                                                                                    configuration is locked. #br#
                                                                                    #br#Once register is locked - reads
                                                                                    give the MMR data and writes are
                                                                                    ignored */
/* GSC_GSC_LOCK[DMA_TRIG_SEL] Bits */
#define GSC_GSC_LOCK_DMA_TRIG_SEL_OFS            (6)                             /* !< DMA_TRIG_SEL Offset */
#define GSC_GSC_LOCK_DMA_TRIG_SEL_MASK           ((uint32_t)0x00000040U)         /* !< Configuration impacts registers
                                                                                    DMA_TRIG_SEL* #br#0: Register
                                                                                    configuration is not locked. #br#1:
                                                                                    Register configuration is locked.
                                                                                    #br# #br#Once register is locked -
                                                                                    reads give the MMR data and writes
                                                                                    are ignored */
/* GSC_GSC_LOCK[DTB_MUXSEL] Bits */
#define GSC_GSC_LOCK_DTB_MUXSEL_OFS              (7)                             /* !< DTB_MUXSEL Offset */
#define GSC_GSC_LOCK_DTB_MUXSEL_MASK             ((uint32_t)0x00000080U)         /* !< Configuration impacts registers
                                                                                    DTB_MUX_SEL #br#0: Register
                                                                                    configuration is not locked. #br#1:
                                                                                    Register configuration is locked.
                                                                                    #br# #br#Once register is locked -
                                                                                    reads give the MMR data and writes
                                                                                    are ignored */
/* GSC_GSC_LOCK[KEY] Bits */
#define GSC_GSC_LOCK_KEY_OFS                     (16)                            /* !< KEY Offset */
#define GSC_GSC_LOCK_KEY_MASK                    ((uint32_t)0xFFFF0000U)         /* !< Write 0xA551 to update the register */

/* GSC_GSC_COMMIT Bits */
/* GSC_GSC_COMMIT[ATTRIBVIOL_CONFIG] Bits */
#define GSC_GSC_COMMIT_ATTRIBVIOL_CONFIG_OFS     (0)                             /* !< ATTRIBVIOL_CONFIG Offset */
#define GSC_GSC_COMMIT_ATTRIBVIOL_CONFIG_MASK    ((uint32_t)0x00000001U)         /* !< 0: Register lock configuration is
                                                                                    not committed. #br#1: Register
                                                                                    configuration is committed.
                                                                                    #br#Commit configuration blocks the
                                                                                    writes going to the lock register.
                                                                                    Once configuration is committed, only
                                                                                    reset can change the configuration. */
/* GSC_GSC_COMMIT[PPC_AATRIB] Bits */
#define GSC_GSC_COMMIT_PPC_AATRIB_OFS            (1)                             /* !< PPC_AATRIB Offset */
#define GSC_GSC_COMMIT_PPC_AATRIB_MASK           ((uint32_t)0x00000002U)         /* !< 0: Register lock configuration is
                                                                                    not committed. #br#1: Register
                                                                                    configuration is committed.
                                                                                    #br#Commit configuration blocks the
                                                                                    writes going to the lock register.
                                                                                    Once configuration is committed, only
                                                                                    reset can change the configuration. */
/* GSC_GSC_COMMIT[SPC_AATRIB] Bits */
#define GSC_GSC_COMMIT_SPC_AATRIB_OFS            (2)                             /* !< SPC_AATRIB Offset */
#define GSC_GSC_COMMIT_SPC_AATRIB_MASK           ((uint32_t)0x00000004U)         /* !< 0: Register lock configuration is
                                                                                    not committed. #br#1: Register
                                                                                    configuration is committed.
                                                                                    #br#Commit configuration blocks the
                                                                                    writes going to the lock register.
                                                                                    Once configuration is committed, only
                                                                                    reset can change the configuration. */
/* GSC_GSC_COMMIT[FPPC_AATRIB] Bits */
#define GSC_GSC_COMMIT_FPPC_AATRIB_OFS           (3)                             /* !< FPPC_AATRIB Offset */
#define GSC_GSC_COMMIT_FPPC_AATRIB_MASK          ((uint32_t)0x00000008U)         /* !< 0: Register lock configuration is
                                                                                    not committed. #br#1: Register
                                                                                    configuration is committed.
                                                                                    #br#Commit configuration blocks the
                                                                                    writes going to the lock register.
                                                                                    Once configuration is committed, only
                                                                                    reset can change the configuration. */
/* GSC_GSC_COMMIT[VTOR] Bits */
#define GSC_GSC_COMMIT_VTOR_OFS                  (5)                             /* !< VTOR Offset */
#define GSC_GSC_COMMIT_VTOR_MASK                 ((uint32_t)0x00000020U)         /* !< 0: Register lock configuration is
                                                                                    not committed. #br#1: Register
                                                                                    configuration is committed.
                                                                                    #br#Commit configuration blocks the
                                                                                    writes going to the lock register.
                                                                                    Once configuration is committed, only
                                                                                    reset can change the configuration. */
/* GSC_GSC_COMMIT[DMA_TRIG_SEL] Bits */
#define GSC_GSC_COMMIT_DMA_TRIG_SEL_OFS          (6)                             /* !< DMA_TRIG_SEL Offset */
#define GSC_GSC_COMMIT_DMA_TRIG_SEL_MASK         ((uint32_t)0x00000040U)         /* !< 0: Register lock configuration is
                                                                                    not committed. #br#1: Register
                                                                                    configuration is committed.
                                                                                    #br#Commit configuration blocks the
                                                                                    writes going to the lock register.
                                                                                    Once configuration is committed, only
                                                                                    reset can change the configuration. */
/* GSC_GSC_COMMIT[DTB_MUXSEL] Bits */
#define GSC_GSC_COMMIT_DTB_MUXSEL_OFS            (7)                             /* !< DTB_MUXSEL Offset */
#define GSC_GSC_COMMIT_DTB_MUXSEL_MASK           ((uint32_t)0x00000080U)         /* !< 0: Register lock configuration is
                                                                                    not committed. #br#1: Register
                                                                                    configuration is committed. #br#Once
                                                                                    configuration is committed, only
                                                                                    reset can change the configuration. */
/* GSC_GSC_COMMIT[KEY] Bits */
#define GSC_GSC_COMMIT_KEY_OFS                   (16)                            /* !< KEY Offset */
#define GSC_GSC_COMMIT_KEY_MASK                  ((uint32_t)0xFFFF0000U)         /* !< Write 0xA442 to update the register */

/* GSC_GSC_REVISION Bits */
/* GSC_GSC_REVISION[MINREV] Bits */
#define GSC_GSC_REVISION_MINREV_OFS              (0)                             /* !< MINREV Offset */
#define GSC_GSC_REVISION_MINREV_MASK             ((uint32_t)0x000000FFU)         /* !< This hardcoded field defines the
                                                                                    minor revision of the IP. */
/* GSC_GSC_REVISION[MAJREV] Bits */
#define GSC_GSC_REVISION_MAJREV_OFS              (8)                             /* !< MAJREV Offset */
#define GSC_GSC_REVISION_MAJREV_MASK             ((uint32_t)0x0000FF00U)         /* !< This hardcoded field defines the
                                                                                    major revision of the IP. */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_gsc__include */

